# ルーターの仕事

{{ TOC }}

## 概要

## L3転送とルーター

L2転送の方式はブロードキャストを使ったARP及びスイッチでのMACアドレス基準での転送となります。
この仕組では異なるネットワークに対して通信を行うことができません。
なぜなら、ネットワークの境界はブロードキャストの境界であり、
送信元ホストが宛先ホストのMACアドレスを知ることもできず、イーサネットで直接やりとりすることもできないためです。

適切にネットワークの設定がされたホストは異なるネットワークへの通信は全てルーターにデータをL2転送します。
それを受け取ったルーターがデータ転送に責任を持ち、どのようにデータを転送するか判断します。
このルーターの転送判断はMACアドレス基準ではなくIPアドレス基準となり、
その転送方式や異なるネットワークにデータを転送することを「**L3転送**」と呼びます。

ルーターでのIPを基準としたL3転送では、宛先ネットワークを基準として
「どのインターフェースから」「どの機器に対して」転送すればいいかを判断します。
L2転送でMACアドレステーブルを使うように、L3転送では「**ルーティングテーブル**」を使います。
本ページではルーティングテーブルの基礎を学び、
ダイナミックルーティングのページではどのようにしてテーブルを構築するかについて学びます。


## 機器の設定

### 構成図

本ページでは3つのネットワークに接続されるPC間で通信をさせます。

![image](./0010_image/01.png)

2つのルーターR1とR2がそれぞれ2つのネットワークに接続され、
そのうちの1つのネットワークでルーター同士が接続されています。
ルーター同士やルーターとPCを直結することもできますが、
スイッチを介して繋ぎ合うという一般的な構成にしています。

### PCのインターフェースの設定

PCのインタフェースの設定は以下となります。
ホスト及びルーターの設定後に、ホストから同一ネットワークにあるルーターのインタフェースにpingが通ることを確認してください。

### ルーターのインターフェースの設定

ルーターのインタフェースの設定は以下となります。
ホストとのping疎通の確認だけでなく、同一ネットワーク内にあるルーター同士の疎通も確認してください。
具体的にはR1からR2の同一ネットワークに属するインターフェース宛の通信です。
インタフェースに設定するIPが間違っているとL3転送ではなくL2転送レベルで問題がおきます。



## デフォルトゲートウェイ

PCやスマホといったホストは他の機器の通信を転送することは基本的にしませんが、
ネットワークに参加するためL2/L3転送を意識した動作をする必要があります。

同一ネットワークへの通信は宛先MACアドレス宛に直接送信することができますが、
異なるネットワーク宛への通信は宛先ホストと直接L2通信をすることができないため、
ルーターにデータ転送を中継をしてもらう必要があります。
ホストが利用する他のネットワークに通信を中継する機器は「**デフォルトゲートウェイ**」と呼ばています。
異なるネットワークに通信するためのデフォルト(標準)のゲートウェイ(出口)という意味です。
デフォルトゲートウェイはそれを利用するホストと同一ネットワーク内に存在する必要があります。
L3転送をしてもらう相手が「転送してもらう必要がある別のネットワーク」に存在していても、
L2通信でそこまで届けられないためです。

宛先ホストに対して「L2転送で直接送るか、L2転送でデフォルトゲートウェイに届けるか」という判断は、
宛先ホストが自分と同じネットワークにいるかどうかで決まります。
この判断には「自分が持つIPアドレス」と「サブネットマスク」及び「宛先ホストのIPアドレス」が関わってきます。

![image](./0010_image/01.png)

たとえば「10.0.0.101/24」のIPを持つホストは「10.0.0.0/24」のネットワークに属しているため、
宛先IPが「10.0.0.102」であれば同一ネットワークだと判断し、
宛先IPが「10.0.1.102」であれば別ネットワークのだと判断します。
同じIPアドレスであっても、この判定はサブネットに依存します。
たとえばホストが「10.0.0.101/16」というIPとサブネットを持っていれば、
「10.0.0.102」だけでなく「10.0.1.102」も同一ネットワークになります。
宛先ホストのサブネットは全く気にしておらず、あくまでも自分のIPとサブネット及び宛先ホストのIPを使って、
宛先ホストが自分と同じネットワークにいるか否かしか判断していません。

### L3転送をする際のL2/L3ヘッダ

ホストの通信をデフォルトゲートウェイでL3転送してもらうには、
送信元ホストがデフォルトゲートウェイに対してデータ(パケット)を届ける必要があります。
ホストとデフォルトゲートウェイは同じネットワークに存在しますので、
ホストからデフォルトゲートウェイへの転送にはL2転送が利用されます。

この時のホストからデフォルトゲートウェイへのパケットは「L2転送で使う宛先MACはデフォルトゲートウェイ」となっているものの、
「L3転送で使う宛先IPは宛先ホスト」となっています。
同一ネットワーク内のホスト間の直接通信では宛先MACと宛先IPは同一の機器のアドレスでしたが、
異なるネットワーク宛の通信ではMACアドレスは転送してもらう機器のアドレスとなり、
IPアドレスは最終的な宛先ホストのアドレスとなっています。

![image](./0010_image/01.png)

これは「スイッチは宛先MACアドレスを見てL2転送する」という仕組みと、
「ルーターは自分のMACアドレス宛のフレームの宛先IPを見て正しい出口からL2転送」という仕組みを使っています。
スイッチはフレームのヘッダの宛先は変更しませんが、
ルーターはパケットを異なるネットワークに転送する際にL2ヘッダの付け替えをします。

異なるネットワークへの通信にはL3転送が利用されますが、
L3転送をする前後の同一ネットワーク内でのパケットのやりとりにはL2転送が使われていることは意識して下さい。
同一ネットワーク内のL2転送が利用されるということは、
デフォルトゲートウェイやルーター間でのMACアドレス解決にARPが利用されるということです。


### Ciscoの機器でのデフォルトルートの設定

ホストはデフォルトゲートウェイの設定がされていないと、
異なるネットワークに属するホスト宛の通信に失敗します。

たとえばPC1と同じネットワークにいるR1のインタフェースG0/1にはpingが届きますが、
異なるネットワークにいるPC2にはpingが届きません。

```text
PC1#ping 10.0.1.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.1.1, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 4/4/6 ms

PC1#ping 10.0.2.102
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.2.102, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
```

![image](./0010_image/01.png)

Ciscoのルーターをホストとして使う場合、
デフォルトゲートウェイの設定はコマンド「**ip route 0.0.0.0 0.0.0.0 <デフォルトゲートウェイのIP>**」となります。
ホストPC1でデフォルトゲートウェイをルーターR1のインターフェースである「10.0.1.1」に設定するには以下のようにします。

```text
PC1#conf t
PC1(config)#ip route 0.0.0.0 0.0.0.0 10.0.1.1
PC1(config)#end
```

この設定をすることでPC1は自身が属する「10.0.1.0/24」のネットワーク以外へのパケットを、
10.0.1.1に対して転送するようになります。

同様の設定をPC2に加えます。
PC2は左右のどちらのルーターにすることができますが、ここでは左側のルーターR1のインターフェースを指定します。
PC1はインターフェース「10.0.0.1」を指定しましたが、PC2はR1の右側のインタフェースである「10.0.1.1」を指定します。
同じネットワークに属するインターフェースを指定する必要があります。

```text
PC2#conf t
PC2(config)#ip route 0.0.0.0 0.0.0.0 10.0.2.1
PC2(config)#end
```

このようにすることで、PC1とPC2はルーターR1を経由して通信することができるようになります。
ルーターR1にとってPC1とPC2は自分が持つインターフェースから直接通信することができるため、
インターフェースへのIPの割り当て以外は特に設定することなく中継できるようになります。

```text
PC1#ping 10.0.2.102
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.2.102, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 5/6/7 ms
```

PC3にもデフォルトゲートウェイの設定を加えます。
ルーターR2の右側のインターフェースのアドレスをデフォルトゲートウェイとして指定します。
同じR2のインターフェースであっても左側は異なるネットワークに属するため、
PC3はL2転送で直接届けることはできません。

```text
PC3#conf t
PC3(config)#ip route 0.0.0.0 0.0.0.0 10.0.3.1
PC3(config)#end
```

これで全てのPCのデフォルトゲートウェイの設定が完了したわけですが、
PC1とPC3はまだ通信ができません。

```text
PC1#ping 10.0.2.102
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.2.102, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
```

デフォルトゲートウェイの設定としては適切ですが、
通信を中継するR1が直接接続されていない「10.0.3.0/24」にどのようにパケットを届ければいいか分かっておらず、
パケットをドロップしてしまうため届きません。
同様にR2も「10.0.1.0/24」にどのようにパケットを届ければいいか把握していません。


## ルーティングテーブル(接続しているネットワーク)

ルーターR1はPC1とPC2の間の通信をL3転送で中継しました。
スイッチと同様にルーターも複数のインターフェースを持つため、
正しくL3転送するには「どういったパケットをどのように転送するか」というルールが必要になります。
これを管理しているのが「**ルーティングテーブル**」で、
どのように転送するかという多くのルールがエントリとして保持されています。

ルーティングテーブルはMACアドレスと出力ポートのマッピングをするMACアドレステーブルよりも仕組みが複雑です。
どのようにエントリを学習するかという点でも複雑ですし、
パケットが届いた時にどのように転送をするかという判断の仕組みも複雑です。
そのため、一度に全ての仕組みを説明するのではなく、
本ページとそれに続く複数のページで簡単なものから順に動きを説明していきます。

ルーティングテーブルが持つ転送ルール(エントリ)で最も簡単なものは、
そのインターフェースが属するネットワーク宛に関するものです。
たとえばR1のg0/1は「10.0.1.1」というIPを持ち、サブネットに「255.255.255.0(/24)」を持っています。
ここから「10.0.1.0/24」のネットワークはg0/1に繋がっているので、
g0/1から「10.0.1.0/24」のネットワークのホスト宛のパケットを出せばいいということが分かります。
同様にR1のg0/2は「10.0.2.1 255.255.255.0」という設定がされているので、
g0/2から「10.0.2.0/24」のネットワークのホスト宛のパケットを出せばいいということも分かります。

シスコのルーターでは「**show ip route**」コマンドでルーティングテーブルを確認できますので、
実際にR1のルーティングテーブルがどのようになっているか見てみます。

```text
R1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR

Gateway of last resort is not set

      10.0.0.0/8 is variably subnetted, 4 subnets, 2 masks
C        10.0.1.0/24 is directly connected, GigabitEthernet0/1
L        10.0.1.1/32 is directly connected, GigabitEthernet0/1
C        10.0.2.0/24 is directly connected, GigabitEthernet0/2
L        10.0.2.1/32 is directly connected, GigabitEthernet0/2
```

重要なのが出力の最後にある4行です。
1行めには「10.0.0.0/24はG0/1インタフェースに直接接続されている」とあり、
2行目には「10.0.0.1/32はG0/1インタフェースに直接接続されている」とあります。
一番左にある「C」や「L」はコマンド出力の前半に意味が書いてあり、
CはConnectedの略で直接接続ネットワークの際に使われて、
LはLocal(リンクローカルとも呼ばれる)の略で自分自身のIPの際に使われます。

インターフェースにIPを設定するだけで、
直接接続されるネットワークと自分自身が持つIPがルーティングテーブルのエントリとして記載されました。
G0/1と同様に、3行目と4行目にG0/2から作られたエントリが存在しています。
これらのエントリを使ってルーターはL3転送を行います。


### ルーティングテーブルの参照とL3転送

ルーターはパケットをL2転送で受け取った際に、
ルーティングテーブルのエントリに従ってL3転送を実施します。

たとえばPC1からPC2へのパケット転送では以下のような流れで転送されます。

0. R1はインターフェースg0/1でパケットをL2転送で受信する
0. パケットの宛先ホストのIPを確認して10.0.1.102宛であることがわかる
0. ルーティングテーブルを確認する
0. 10.0.1.102は「直接接続ネットワーク 10.0.1.0/24」のエントリに含まれることがわかる
0. 10.0.1.0/24はインターフェースg0/2に直接接続されていることがわかる
0. g0/2から10.0.1.102宛のパケットをL2転送で送信する

ようするにL2転送で受け取ったパケットの宛先IPをルーティングテーブルと照らしあわせてL3転送の方針を決めて、
次の宛先へとL2転送するというのがルーターが行うL3転送の処理の流れです。
R2がPC2にL2転送を行う際は宛先のMACアドレスが必要になるため、
必要に応じてARPが使われます。

先に説明したように、ルーティングされる際にMACアドレス(L2アドレス)の付け直しがされますが、
IPアドレス(L3アドレス)はもとのままです。

![image](./0010_image/01.png)

直接接続されるネットワークのエントリは自動で作成されますが、
逆に言えば直接接続されないネットワークのエントリは自動では作成されません。
たとえばR1のルーティングテーブルには一番右側のネットワークである「10.0.3.0/24」のエントリがありません。
そのため、R1は10.0.3.103宛のパケットをどのように転送すればいいか分かりません。

ルーティングテーブルのエントリに存在しないネットワーク宛のパケットは、
届けようがないためルーターで破棄されます。
数百台以下の規模が一般的な1つのネットワーク内ではフラッディングにより宛先になんとか届けようとしても問題ありませんが、
ネットワーク間で同じことをしてしまうとアフリカの宛先不明のパケットが日本まで届くような状況ですので、
インターネットが宛先不明のパケットで溢れてしまいます。
そのため、L3転送における宛先不明な通信は、容赦なくパケットが破棄されます。

簡単なネットワークであればスイッチは雑な設定をしても動きますが、
ルーターはきちんと設定をしなければ動きません。


## ルーティングテーブル(直接接続していないネットワーク)

自宅にあるバッファローのルーターがYahooやGoogleにパケットを届けることができるように、
ルーターは直接接続されないネットワークあてのパケットも転送する必要もあります。

今まで利用していた構成では「ルーターR1はルーターR2にパケットを転送すれば、
10.0.3.0/24のホストにパケットを届けられる」ということが、
ネットワークを俯瞰的に見れる人間には明確です。

![image](./0010_image/01.png)

ただ、これをルーターに分からせるためには、
きちんとルーティングテーブルのエントリという形で表現する必要があります。
具体的にはR1のルーティングテーブルに直接接続されない「10.0.3.0/24」のエントリを作成し、
同様にR2にも「10.0.1.0/24」のエントリを作成する必要があるということです。

自分が接続しないネットワークへの転送方法の定義(ルーティングテーブルのエントリの作成方法)ですが、
自分で定義する「**スタティックルート**」と呼ばれる方法と、
ルーター間で会話して自動で定義を学習させる「**ダイナミックルート**」と呼ばれる手法の2つがあります。
これらのどちらも設定されていないと、
ルーティングテーブルには直接接続のネットワークしか記載されずにパケットを届けることができません。

先ほどのR1のルーティングテーブルのエントリは、
特に設定を加えていない状態でしたので以下のようになっています。

```text
R1# show ip route
省略

      10.0.0.0/8 is variably subnetted, 7 subnets, 2 masks
C        10.0.1.0/24 is directly connected, GigabitEthernet0/1
L        10.0.1.1/32 is directly connected, GigabitEthernet0/1
C        10.0.99.0/24 is directly connected, GigabitEthernet0/2
L        10.0.99.1/32 is directly connected, GigabitEthernet0/2
```

「10.0.3.0/24」のエントリは存在していません。

本ページでは比較的単純なスタティックルートでR1及びR2にエントリを追加し、
PC1とPC3の間で通信を成功させます。
ダイナミックルートは設定方法や学習の仕組みが複雑なため別ページにて扱いますが、
エントリが作成されたあとのL3転送の動きは大差がありません。


スタティックルートは管理者がルーターに対して「このネットワーク宛の通信はここに送る」と定義をすることで、
直接接続されないネットワークへの転送を実現します。
上記の図ではルーター1は「10.0.2.0/24」にパケットを送るには、
ルーター1に隣接するルーター2のインターフェース「10.0.99.2」に対してパケットを送ればよいということです。

スタティックルートを設定するには「ip route <ネットワークアドレス> <サブネットマスク> 中継するIP」とします。

```text
R1(config)#ip route 10.0.2.0 255.255.255.0 10.0.99.2
```

このようにすることで、ルーティングテーブルが以下のように変化します。

```text
R1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR

      10.0.0.0/8 is variably subnetted, 7 subnets, 2 masks
C        10.0.1.0/24 is directly connected, GigabitEthernet0/1
L        10.0.1.1/32 is directly connected, GigabitEthernet0/1
S        10.0.2.0/24 [1/0] via 10.0.99.2
C        10.0.99.0/24 is directly connected, GigabitEthernet0/2
L        10.0.99.1/32 is directly connected, GigabitEthernet0/2
```

エントリの3つめに「10.0.2.0/24」は「10.0.99.2」を経由(via)というものが増えています。
これがスタティックルートと呼ばれる設定手法で、スタティックルートで設定されたという印に一番左に「S」とあります。
出力上部のコードを見ると「S」は「static」とあります。

このようにすることでルーター1は10.0.2.0/24宛のパケットをルーター2に転送するようになります。
ルーター2にも同様に10.0.1.0/24宛のパケットは10.0.99.1を経由するとスタティックルートに記載します。

```text
R2(config)#ip route 10.0.1.0 255.255.255.0 10.0.99.1
```

こうすることでR2のルーティングテーブルは以下のようなものとなります。

```text
R2#show ip route
省略
      10.0.0.0/8 is variably subnetted, 7 subnets, 2 masks
S        10.0.1.0/24 [1/0] via 10.0.99.1
C        10.0.2.0/24 is directly connected, GigabitEthernet0/1
L        10.0.2.1/32 is directly connected, GigabitEthernet0/1
C        10.0.99.0/24 is directly connected, GigabitEthernet0/2
L        10.0.99.2/32 is directly connected, GigabitEthernet0/2
```

![image](./0010_image/01.png)

これで10.0.1.101のPC1と10.0.2.102のPC2の間で通信ができるようになりました。

```text
PC1>ping 10.0.2.102
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.2.102, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 14/16/20 ms
```

## デフォルトルート

先ほど説明したようにルーティングテーブルにエントリがない宛先へのパケットはルーターで破棄されてしまいます。
「**デフォルトルート**」はデフォルトゲートウェイのルーター版であり、
特別に指定されていない宛先は全てこのアドレスに転送をするというものです。

![image](./0010_image/01.png)

スタティックルートの書き方で「10.0.1.0 255.255.255.0」とすると「10.0.1.0/24」のことを表します。
そして「10.0.0.0 255.255.0.0」とすれば「10.0.0.0/16」のことを表します。
「10.0.0.0/16」は「10.0.1.0/24」のことも含んでいますので、より大きな範囲指定をしています。
このルーティングテーブルで書かれるエントリのネットワークは必ず存在しているという必要はなく、
あくまでも転送ルールにすぎません。

この大きな範囲のネットワークのかきかたをつきつめると「0.0.0.0 0.0.0.0」となります。
これは「全てのアドレス」を意味しているため、どのIPアドレスに送るにしてもこのエントリに該当するようになります。

実はホストとして使っているルーターに設定していたデフォルトゲートウェイの設定は、
デフォルトルートの設定となります。

```text
PC1#conf t
PC1(config)#ip route 0.0.0.0 0.0.0.0 10.0.1.1
PC1(config)#end
```

ルーティングテーブル

```text
10.0.0.0/8 is variably subnetted, 4 subnets, 2 masks
C        10.0.1.0/24 is directly connected, GigabitEthernet0/1
L        10.0.1.1/32 is directly connected, GigabitEthernet0/1
C        10.0.2.0/24 is directly connected, GigabitEthernet0/2
L        10.0.2.1/32 is directly connected, GigabitEthernet0/2

S 0.0.0.0/0 via 10.
```

詳しくは別ページで扱いますが、ルーティングテーブルのエントリは重複が許されていて、
重複している場合は「**最も優先度がエントリに従って転送をする**」というルールがあります。
上記で言えば「0.0.0.0/0」は全てのネットワークのことなので、
「10.0.1.0/24」や「10.0.2.0/24」も含まれてしまうため重複しているといえます。

ただ、「10.0.2.0/24」のエントリは「0.0.0.0/0」より優先度が高いため、
10.0.2.0/24宛の通信は「10.0.2.0/24」のエントリに従って転送されます。
一方、10.0.3.0/24宛の通信は条件に合致するのは「0.0.0.0/0」だけなので、このエントリに従って転送されます。

![image](./0010_image/01.png)

家庭用のブロードバンドルーターは実はこのデフォルトルートだけを持っています。
本来のルーターは様々なネットワークに接続してルーティングテーブルのエントリに従って複雑な転送ルールに従って転送をしますが、
ブロードバンドルーターは自分が直接接続する家庭内のネットワーク及びサービスプロバイダー側のネットワークのアドレス以外は、
全てサービスプロバイダーのルーターに転送をします。

一般的な家庭にはインターネットへの接続口がサービスプロバイダーしかなく、家のネットワークも1つしかありません。
そのため、全てをサービスプロバイダーのルーターに任せるという動きで十分なのです。
