# VLAN

{{ TOC }}

## ネットワークの仮想化

今まで学んできた構成はスイッチに接続されたネットワーク機器が一つのネットワークを作りました。
これはつまり作るネットワークの数以上のスイッチが必要ということです。

第二章でお話したように1つのネットワークは必要以上に大きくすることが望ましくないため、
適切なサイズに分離する必要があります。
ただ、ネットワークの数だけ機器をそろえると金銭面、管理面のコストが大幅に増大してしまいます。

そのため、1つのネットワーク機器でいくつものネットワークを扱う様々な技術が利用され、
その代表的なものがVLAN(L2)とVRF(L3)です。
L3スイッチは実質的にVLANの仕様が必須ですので、まずはVLANの仕組みと使い方について説明をしましょう。

## VLAN

### なぜVLANが必要か

第二章はMACアドレスを使ったパケット転送の仕組みについて集中的にお伝えしたかったので扱いませんでしたが、
スイッチにはVLAN(Virtual LAN)と呼ばれる重要な機能があります。

その名前から分かるようにVLANは1台のスイッチでLANを仮想的に分割する技術です。
家庭用のスイッチを思い浮かべて頂くと分かりますが、全てのポートが同じグループに属していると、
そこに繋がる機器は全てお互いに通信ができます。
家庭内であればそれで問題ないでしょうが、企業のネットワークだとお客さんがアクセスできるネットワークと
社員向けのネットワークを分離する必要などがあります。

<<図>>

上記の構成では1つのスイッチ(実際は冗長化のために同じ設定がされたスイッチ2台以上を使います)が、
お客さん向け、社内向け、社外向けサーバー(例えばウェブサーバー)、
社内向けサーバー(例えばファイル共有サーバーやActive Directoryなど)とネットワークを区切っています。
ネットワークが区切られているため、お客さんのノートPCが社内ファイルサーバーにアクセスすることを防げます。
これには後の章で話すセキュリティ関係の話が絡みますので、その際に詳細を扱います。

上記のように1台のスイッチに複数の別個のネットワークを扱わせるのではなく、
ネットワークごとに物理スイッチを買うという選択肢もあります。
ただ、ネットワークが増えれば増えるほど機器の台数が増えて金銭コストもかかりますし、管理しきれなくなります。
そのため、ある規模以上の社内インフラを作る場合はVLANが利用されることが一般的です。

### VLANの仕組み

第二章で学んだL2転送の仕組みを思い出して下さい。
L2転送において最も重要だったのは「MACアドレステーブル」を使った「宛先MACアドレスと出力ポートのマッピング」でした。
VLANはこのMACアドレステーブルを複数に分割し、各MACテーブルに利用するポートを結びつけます。

たとえば1つめのネットワークとなるVLAN1は、VLAN1のMACアドレステーブルとそれを使うポート群を持っています。
そして2つめのネットワークとなるVLAN2は、VLAN2のMACアドレステーブルとそれを使うポート群を持っています。
VLAN1のネットワークとVLAN2のネットワークは異なるため、通信は完全に分離されています。
たとえばVLAN1の機器がARP Requestを出しても、それはVLAN1のポートにのみフラッドされて、
VLAN2にフラッドされることはありません。
VLAN2の機器のARPもこれと同様です。

<<図>>

上記の構成ではスイッチのG0/1とG0/2がVLAN1に割り当てられており、
G0/3とG1/0がVLAN2に割り当てられています。
G0/1に接続されるPC1は同じVLAN1に属するPC2には通信をできますが、
PC3とPC4はVLANが異なるため通信できません。
VLAN1とVLAN2はネットワークが異なるため、
本来であれば「10.0.1.0/24」「10.0.2.0/24」といった異なるネットワークアドレスを使うべきですが、
「同じネットワークでなければARPが出されない」という仕組みがあるため、
あえて同じレンジにしています。

ここまでの話を実際に機器を操作しながら確認してみます。
まずVLANを使うためにはVLANを作る必要があります。
これには「vlan <VLAN番号コマンド>」を使います。

```
S1(config)# vlan 2
S1(config-vlan)# end
```

存在するVLANを確認するためには「show vlan」コマンドを使います。
このコマンドはどのVLANにどのポートが属しているかも表示してくれます。

```
S1# show vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Gi0/0, Gi0/1, Gi0/2, Gi0/3
                                                Gi1/0
2    VLAN0002                         active    
```

現在はVLAN1とVLAN2が存在することが分かります。
VLAN1は最初から存在し、VLAN2は先ほど作りました。
そしてVLAN1にはポートG0/0(VIRLの管理ポート)からG1/0までが属していることが分かります。

先の構成を作るために、G0/3とG1/0の2つのポートをVLAN2に加えます。
これにはインターフェース設定モードにて「switchport access vlan <VLAN番号>」を使います。
今回ですと以下のようになります。

```
S1(config)#int g0/3
S1(config-if)#switchport access vlan 2
S1(config-if)#int g1/0
S1(config-if)#switchport access vlan 2
```

あらためて「show vlan」コマンドでVLANの設定を確認します。

```
S1#show vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Gi0/0, Gi0/1, Gi0/2
2    VLAN0002                         active    Gi0/3, Gi1/0
```

G0/1とG0/2がVLAN1に属し、G0/3とG1/0がVLAN2に属するという構成を作れました。
PC同士に通信をさせて、VLAN1とVLAN2のネットワークが分離されていることを確認します。

```
PC1#ping 10.0.1.102
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.1.102, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 5/5/6 ms
```

PC1とPC2は同じL2ネットワークであるVLAN1に属するため、pingが成功します。
一方、PC1とPC3は異なるVLANであるため、pingが失敗します。

```
PC1#ping 10.0.1.103
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.1.103, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
```

PC3からPC2への通信もVLANが異なるためpingに失敗しますが、
PC3からPC4へは同じVLANであるためpingが成功します。

```
PC3#ping 10.0.1.102
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.1.102, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
PC3#ping 10.0.1.104
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.1.104, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 3/3/4 ms
```

第二章で使った「show mac address-table」コマンドでMACテーブルを確認すると、
MACアドレスとポートの情報だけでなく、VLAN番号も記載があることが分かります。

```
S1#show mac address-table
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----
   1    0000.0000.0101    DYNAMIC     Gi0/1
   1    0000.0000.0102    DYNAMIC     Gi0/2
   2    0000.0000.0103    DYNAMIC     Gi0/3
   2    0000.0000.0104    DYNAMIC     Gi1/0
Total Mac Addresses for this criterion: 4
```

VLAN1のポートから来たフレームの転送にはVLAN1のMACテーブルのみが利用され、
VLAN2は全く関係がありません。


## アクセスポートとトランクポート

小規模なネットワークはスイッチ1台で実現できますが、
大きなネットワークを作るためにはVLANを設定した複数のスイッチを接続します。
その際、どのネットワークにどのVLAN番号を使うかは、必ず接続される全てのスイッチで統一してください。
たとえば「10.0.1.0/24」をスイッチAでVLAN1にし、スイッチBではVLAN2にするといったことはしないでください。
技術的には可能ですが管理が大変になるだけでメリットがありません。

当然ですが、上位のスイッチと下位のスイッチを繋ぐリンクもVLANを意識する必要があります。
スイッチとスイッチがVLAN1のポートでのみ繋がれていれば、
VLAN2のネットワークの通信はスイッチを跨って行き来することができません。
存在するVLANの数だけポートとケーブルを利用するというのも一つの手法ですが、
VLANが100個存在すれば100本も繋ぐ必要があるため現実的ではありません。

「トランク(Trunk)」という仕組みを使うことで、この問題を解決できます。
トランクはスイッチとスイッチを繋ぐポートで複数のVLANを流すために用いられ、
スイッチAとスイッチBを繋ぐポートを「トランクポート」として設定すると、VLAN1もVLAN2もそのポートを使います。
なお、今まで利用してきた1つのVLANしか流さないポートは「アクセスポート」と呼ばれています。

<<図>>

ただ、同じリンクで複数のVLANのフレームをやりとりするということは、
そのフレームがどのVLANのものかを識別できる目印のようなものが必要だということです。
スイッチはフレームをトランクポートに転送する際に「タグ」と呼ばれる目印を付けることで、
それがどのフレームのものかを識別しています。
また、「タグがない」というのも1つのVLANを識別する手がかりになるため、
必要に応じて「このVLANのフレームはトランクポートにタグなしとする」と設定することができます。
このトランクポートでのタグを使わないVLANのことを「ネイティブ VLAN (native vlan)」と呼びます。
そして、ネイティブVLANでないVLANは全てタグがついていますので、「タグVLAN Tag VLAN」と呼ばれます。
トランクのタグがどのように実現されているかは第六章(TCP/IP)にて扱います。

アクセスポートとトランクポートがどのようなものか分かって頂けたかと思いますので、
実際に以下のようなネットワークを構築します。

<<図>>

スイッチのポートのモード(アクセスorトランク)を設定するには「switchport mode <access|trunk>」コマンドを使います。
デフォルトはアクセスポートとなっています。

```
S1(config-vlan)#int g0/3
S1(config-if)#switchport trunk encapsulation dot1q
S1(config-if)#switchport mode trunk
```

上記の例ではトランクポートに設定する前に、
トランクを実現する手法(タグのつけかた)を「dot1q」として設定しています。
dot1q以外の手法も使えますが、完全に廃れていますのでdot1qを指定してください。

トランクポートを確認するには「show interface trunk」コマンドを使います。
これを使うとトランクポートの一覧と、それぞれのポートがどのVLANを通しているのかが分かります。

```
S1#show int trunk

Port        Mode             Encapsulation  Status        Native vlan
Gi0/3       on               802.1q         trunking      1

Port        Vlans allowed on trunk
Gi0/3       1-4094

Port        Vlans allowed and active in management domain
Gi0/3       1-2

Port        Vlans in spanning tree forwarding state and not pruned
Gi0/3       1-2
```

注意をしてほしいのは「show vlan」コマンドではトランクポートが表示されないことです。
これにはアクセスポートしか表示されません。

```
S1#show vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Gi0/0, Gi0/1
2    VLAN0002                         active    Gi0/2
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        0      0   
2    enet  100002     1500  -      -      -        -    -        0      0   
1002 fddi  101002     1500  -      -      -        -    -        0      0   
1003 tr    101003     1500  -      -      -        -    -        0      0   
1004 fdnet 101004     1500  -      -      -        ieee -        0      0   
1005 trnet 101005     1500  -      -      -        ibm  -        0      0   

Remote SPAN VLANs
------------------------------------------------------------------------------


Primary Secondary Type              Ports
------- --------- ----------------- ------------------------------------------
```

スイッチ2にも同様の設定を加えて、スイッチ3のポートもトランクに変更します。
1つのポートずつトランクの設定をしても良いのですが、3つのポートに同じ設定をいれるため、
「range」を使って複数のインターフェースを同時に指定してみます。

```
S3(config)#int range g0/1-3
S3(config-if-range)#switchport trunk encapsulation dot1q
S3(config-if-range)#switchport mode trunk
```

rangeに続けて複数のインターフェースを指定でき、上記はg0/1からg0/3を指定しています。
このコマンドを発行した後でトランクインターフェースの一覧を確認すると、
確かにg0/1からg0/3までが、まとめてトランクの設定をされていることが分かります。

```
S3#show interfaces trunk

Port        Mode             Encapsulation  Status        Native vlan
Gi0/1       on               802.1q         trunking      1
Gi0/2       on               802.1q         trunking      1
Gi0/3       on               802.1q         trunking      1

Port        Vlans allowed on trunk
Gi0/1       1-4094
Gi0/2       1-4094
Gi0/3       1-4094

Port        Vlans allowed and active in management domain
Gi0/1       1-3
Gi0/2       1-3
Gi0/3       1-3

Port        Vlans in spanning tree forwarding state and not pruned
Gi0/1       1-3
Gi0/2       1-3
Gi0/3       none
```

この設定が完了したら、3台のスイッチをまたがってVLANが繋がります。
同じVLANのPC同士でpingができることを確認してください。

最後に次のセクションのためにSW3のルーターに接続するポートG0/3で、
ネイティブVLANを変更します。
デフォルトのネイティブVLANはVLAN1であるため、VLAN1のフレームにはタグがついていません。
ただ、G0/3ではデフォルトVLANを全く利用しないVLAN99に割り当てます。
こうすることで、VLAN1にもタグがつけられるようになります。

```
switchport trunk native vlan 99
```

<<図>>

注意をして欲しいのはスイッチとスイッチを接続する場合は、
ネイティブVLANを必ず揃える必要があるということです。
たとえばスイッチAとスイッチBがつながっており、スイッチAのポートのネイティブVLANが10で、
スイッチBのネイティブVLANが20だとします。
このときスイッチAがVLAN10のフレームをスイッチBに転送すると、そのフレームはVLAN20に変化してしまいます。
繋がるべき通信ができなかったり、繋がるべきでない箇所が繋がるため、必ず揃えて下さい。

## 通過させるVLANの制御

VLANの制御をする際に重要になるのが、どのVLANを通すかということです。
適切に設定されておらずVLANが分断されてしまったり、
不必要にスイッチ間でVLANを繋げすぎて無駄に大きいネットワークを作ることはよくありません。

VLANを扱ううえでまず知っておくべきことは、あるVLAN-Xがスイッチで作成されていないと、
そのVLAN-Xのフレームは全て破棄するということです。
例えば以下のような構成だと、下位のスイッチにはVLAN-2があるものの、
それらを繋ぐ上位のスイッチにVLAN-2が存在しないため、フレームを届けることができません。

<<図>>

上位のスイッチでは下位のスイッチが使っている全てのVLANを作成しておくようにしてください。
試しにSW3でVLANを消してみると、スイッチを跨ぐ通信が届かなくなることが確認できるはずです。
なお、VLAN1は消せません。

フレームを届けられないほど大きな問題ではありませんが、
不必要にフレームを届けすぎてしまうことも問題となります。
例えば以下の図を見て下さい。

<<図>>


「アラウドVLAN(Allowed VLAN)」をトランクポートに設定することで、
VLANの通信を届けすぎてしまうことを防げます。
許可する(Allow)という名前から分かるように、
アラウドVLANとして設定されたVLANのフレームだけをそのポートで送受信するようになります。
デフォルトは全てのVLANを許可しています。

アラウドVLANの設定方法は複数あり、全てを列挙したり、これ以外と指定したり、今ある設定にこれを追加などとできます。
細かい設定方法は本質にはそれほど重要ではないため、
ここでは全てを列挙する「switchport trunk allowed vlan <VLAN番号群>」を使います。

```
S3(config)#int g0/1
S3(config-if)#switchport trunk allowed vlan 1,2  
```

この設定をすると、g0/1のインターフェースではVLAN1,2しかやりとりしないようになります。
それ以外の全てのVLAN宛のフレームが届いた場合は破棄しますし、
そのポートからVLAN1,2以外のフレームを出さないようになります。

アラウドVLANの設定も「show interface trunk」で確認できます。

```
S3#show int trunk

Port        Mode             Encapsulation  Status        Native vlan
Gi0/1       on               802.1q         trunking      1
Gi0/2       on               802.1q         trunking      1
Gi0/3       on               802.1q         trunking      1

Port        Vlans allowed on trunk
Gi0/1       1-2
Gi0/2       1-4094
Gi0/3       1-4094

Port        Vlans allowed and active in management domain
Gi0/1       1-2
Gi0/2       1-3
Gi0/3       1-3

Port        Vlans in spanning tree forwarding state and not pruned
Gi0/1       1-2
Gi0/2       1-3
Gi0/3       1-3
```

オフィスネットワークですと、ネイティブVLANとアラウドVLANの活用場面はあまり多くありません。
ただ、サーバールームやデータセンターなどではよく利用されています。
コラムに記載しましたので興味があるかたはご一読ください。
