# VLAN

{{ TOC }}

## ネットワークの仮想化

スイッチは同じネットワークに繋がる機器同士を繋げるための機器です。
なにも設定をしないと、全てのポートに繋がる機器は同じネットワークに属することになります。

自宅のようにネットワークがひとつであればこれでも構いませんが、
企業の場合はネットワークが数多く存在するため、ひとつのスイッチがひとつのネットワークしか扱えないというのは不便です。
ネットワークが増えれば増えるほど機器の台数が増えて金銭コストもかかりますし、管理しきれなくなります。

![image](./0025_image/01.png)

この問題を解決するためにスイッチには「**VLAN(Virtual LAN)**」と呼ばれる機能があります。
簡単にいってしまえばスイッチのポートをネットワークごとにグループ分けすることで、
ひとつのスイッチで複数のネットワークを扱えるようにします。

物理的にネットワークごとにスイッチを分ける構成は、
VLANを使うことで以下のように集約することができます。

![image](./0025_image/01.png)

本ページではこのVLANの仕組みと使い方について順に説明していきます。

## VLANの作成とポートへの割り当て

VLANのグループには「VLAN1からVLAN4096まで」が存在しており、
各ポートはそのうちのひとつか複数のVLANに属しています。
このグループは「VLAN ID」や「VLAN番号」などと呼ばれています。
たとえば「VLAN ID 1」や「VLAN番号100」などです。

各ポートに設定されているデフォルトのVLANはVLAN1であるため、
設定変更されていなければ全てのポートが同じネットワーク(VLAN1)に属しています。
つまり家庭用スイッチと同じように繋がる機器は全て通信可能ということです。

ポートが属するVLANをVLAN1からVLAN100に変えれば、
VLAN1に繋がる機器とVLAN100に繋がる機器は直接通信することはできなくなります。
他にもVLAN100のポートを作れば、VLAN100のポートに繋がる機器同士では通信をすることができます。

以下のように構成変更をすることでVLANの特徴を確認します。

![image](./0025_image/01.png)

もともと全てのポートがデフォルトのVLAN1に属しているものを、
新しくVLAN2を作って、ポートをVLAN2に属させます。
VLAN1とVLAN2はどちらもネットワークのアドレスとしては同じですが、
L2セグメントが異なるため通信できなくなります。

なお、本来はL2セグメントが異なれば異なるネットワークアドレスを使う必要があります。
あくまでも実験的なネットワーク構成だですので注意願います。

### VLANの作成

VLAN1以外のVLANを利用するには、そのVLANを作成して、
各ポートが属するVLANを変更する必要があります。

まずVLANを使うためにはVLANを作る必要があります。
これには「vlan <VLAN番号コマンド>」を使います。

#### VLANの作成

```
S1(config)# vlan 2
S1(config-vlan)# end
```

存在するVLANを確認するためには「show vlan」コマンドを使います。
このコマンドはどのVLANにどのポートが属しているかも表示してくれます。

#### VLANの確認

```
S1# show vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Gi0/0, Gi0/1, Gi0/2, Gi0/3
                                                Gi1/0
2    VLAN0002                         active    
```

存在する全てのポートがデフォルトのVLAN1に属していて、
VLAN2にはどのポートも属していません。


### インターフェースへのVLANの設定

先の構成を作るために、G0/3とG1/0の2つのポートをVLAN2に加えます。
これにはインターフェース設定モードにて「switchport access vlan <VLAN番号>」を使います。
今回ですと以下のようになります。

#### インターフェースへのVLAN設定

```
S1(config)#int g0/3
S1(config-if)#switchport access vlan 2
S1(config-if)#int g1/0
S1(config-if)#switchport access vlan 2
```

あらためて「show vlan」コマンドでVLANの設定を確認します。

#### VLANの確認

```
S1#show vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Gi0/0, Gi0/1, Gi0/2
2    VLAN0002                         active    Gi0/3, Gi1/0
```


グループごとにひとつのネットワークに属するようにする

第二章でお話したように1つのネットワークは必要以上に大きくすることが望ましくないため、
適切なサイズに分離する必要があります。
ただ、ネットワークの数だけ機器をそろえると金銭面、管理面のコストが大幅に増大してしまいます。

そのため、1つのネットワーク機器でいくつものネットワークを扱う様々な技術が利用され、
その代表的なものがVLAN(L2)とVRF(L3)です。
L3スイッチは実質的にVLANの仕様が必須ですので、まずはVLANの仕組みと使い方について説明をしましょう。


### VLAN内の通信の確認

G0/1とG0/2がVLAN1に属し、G0/3とG1/0がVLAN2に属するという構成を作れました。
PC同士に通信をさせて、VLAN1とVLAN2のネットワークが分離されていることを確認します。

```
PC1#ping 10.0.1.102
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.1.102, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 5/5/6 ms
```

PC1とPC2は同じL2ネットワークであるVLAN1に属するため、pingが成功します。
一方、PC1とPC3は異なるVLANであるため、pingが失敗します。

```
PC1#ping 10.0.1.103
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.1.103, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
```

PC3からPC2への通信もVLANが異なるためpingに失敗しますが、
PC3からPC4へは同じVLANであるためpingが成功します。

```
PC3#ping 10.0.1.102
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.1.102, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
PC3#ping 10.0.1.104
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.1.104, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 3/3/4 ms
```

### VLANとMACアドレステーブル

二章で使った「show mac address-table」コマンドでMACテーブルを確認すると、
MACアドレスとポートの情報だけでなく、VLAN番号も記載があることが分かります。

```
S1#show mac address-table
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----
   1    0000.0000.0101    DYNAMIC     Gi0/1
   1    0000.0000.0102    DYNAMIC     Gi0/2
   2    0000.0000.0103    DYNAMIC     Gi0/3
   2    0000.0000.0104    DYNAMIC     Gi1/0
Total Mac Addresses for this criterion: 4
```

VLAN1のポートから来たフレームの転送にはVLAN1のMACテーブルのみが利用されます。
宛先アドレスがVLAN1のテーブル内に存在すれば、そのポートに転送されます。
宛先アドレスがVLAN1のテーブル内になければ、VLAN1の全ポートにてユニキャストフラッディングが実施されます。
VLAN2に宛先MACのエントリがたとえあったとしても、それは利用されません。


## アクセスポートとトランクポート

大きなネットワークを作るためには複数のスイッチを階層構造を作って接続します。
各スイッチに複数のVLANが設定されている場合、
スイッチ間を接続するポートは一般的に「**トランクポート**」と呼ばれる「複数のVLANを使えるポート」の設定にします。
今までのような各ポートがひとつのVLANしか使えない設定をすると、VLANの数だけスイッチ間を接続しなければならなくなるためです。

複数のVLANをスイッチ間の1つのリンクでやりとりするためには、
スイッチ間を流れる各フレームがどのVLANかを識別できるようにする必要があります。
これはフレームのイーサネットヘッダにVLAN番号を記載した「**VLANタグ**」という目印をつけることで実現しています。
フレームを送信する側のスイッチは、送信する際にVLANに応じたタグをつけて送ります。
受け取る側はそのタグを見ることで、どのVLANあての通信かを識別できます。

なお、「VLANタグをつけない」ということもひとつのVLANを識別するためのルールとして使えます。
多くのVLANはタグありで利用されますが、ひとつのVLANだけはタグなしで送ることができ、
そのVLANは「ネイティブVLAN」や「VLAN 0」と呼ばれます。

![image](./0025_image/01.png)

今まで利用してきた「1つのポートで1つのVLANしか使えない」ポートは「**アクセスポート**」と呼ばれています。
ひとつのVLANしか利用しないため、フレームにはVLANを識別するためのタグは設定されていません。

一般的には「スイッチの間はトランクポートで接続する」「ホストとスイッチはアクセスポートで接続する」というルールがあります。
ホストが仮想化サーバーなどであれば、ホストともトランク接続することが多いです。

以下のような構成を作成することでトランクの設定と動作について確認します。

![image](./0025_image/01.png)


### トランクポートの設定

トランクポートを実現するタグのつけかたには複数種類ありますが、現在は「**Dot1Q**」と呼ばれるものが主流です。
タグの付け方を指定するにはインターフェース設定モードで「switchport trunk encapsulation dot1q」コマンドを使います。

タグの付け方を指定すれば、インターフェースのモードを「switchport mode trunk」でトランクに変えられます。
インターフェースのデフォルトのモードはアクセスで、トランクからアクセスに戻すには「switchport mode access」を入力します。

```
S1(config-vlan)#int g0/3
S1(config-if)#switchport trunk encapsulation dot1q
S1(config-if)#switchport mode trunk
```

スイッチ2にも同様の設定を加えて、スイッチ3のポートもトランクに変更します。
1つのポートずつトランクの設定をしても良いのですが、3つのポートに同じ設定をいれるため、
「range」を使って複数のインターフェースを同時に指定してみます。

```
S3(config)#int range g0/1-3
S3(config-if-range)#switchport trunk encapsulation dot1q
S3(config-if-range)#switchport mode trunk
```

スイッチのポートのVLAN関係の設定はリンクを結ぶ両スイッチで整合性を持って行う必要があります。
片方のスイッチでVLANを作成し忘れていたりすると、そのVLANの通信はそのスイッチを通過できなくなります。
アクセスポートとトランクポートを接続したり、
VLAN番号の違うアクセスポート同士を接続するといったことは障害に繋がるため注意してください。

トランクポートを確認するには「show interface trunk」コマンドを使います。
これを使うとトランクポートの一覧と、それぞれのポートがどのVLANを通しているのかが分かります。


```
S3#show interfaces trunk

Port        Mode             Encapsulation  Status        Native vlan
Gi0/1       on               802.1q         trunking      1
Gi0/2       on               802.1q         trunking      1
Gi0/3       on               802.1q         trunking      1

Port        Vlans allowed on trunk
Gi0/1       1-4094
Gi0/2       1-4094
Gi0/3       1-4094

Port        Vlans allowed and active in management domain
Gi0/1       1-3
Gi0/2       1-3
Gi0/3       1-3

Port        Vlans in spanning tree forwarding state and not pruned
Gi0/1       1-3
Gi0/2       1-3
Gi0/3       none
```

この設定が完了したら、3台のスイッチをまたがってVLANが繋がります。
同じVLANのPC同士でpingができることを確認してください。

### アラウドVLANの設定

VLANの制御をする際に重要になるのが、どのVLANを通すかということです。
適切に設定されておらずVLANが分断されてしまったり、
不必要にスイッチ間でVLANを繋げすぎて無駄に大きいネットワークを作ることはよくありません。

VLANを扱ううえでまず知っておくべきことは、あるVLAN-Xがスイッチで作成されていないと、
そのVLAN-Xのフレームは全て破棄するということです。
例えば以下のような構成だと、下位のスイッチにはVLAN-2があるものの、
それらを繋ぐ上位のスイッチにVLAN-2が存在しないため、フレームを届けることができません。

<<図>>

上位のスイッチでは下位のスイッチが使っている全てのVLANを作成しておくようにしてください。
試しにSW3でVLANを消してみると、スイッチを跨ぐ通信が届かなくなることが確認できるはずです。
なお、VLAN1は消せません。

フレームを届けられないほど大きな問題ではありませんが、
不必要にフレームを届けすぎてしまうことも問題となります。
例えば以下の図を見て下さい。

<<図>>


「アラウドVLAN(Allowed VLAN)」をトランクポートに設定することで、
VLANの通信を届けすぎてしまうことを防げます。
許可する(Allow)という名前から分かるように、
アラウドVLANとして設定されたVLANのフレームだけをそのポートで送受信するようになります。
デフォルトは全てのVLANを許可しています。

アラウドVLANの設定方法は複数あり、全てを列挙したり、これ以外と指定したり、今ある設定にこれを追加などとできます。
細かい設定方法は本質にはそれほど重要ではないため、
ここでは全てを列挙する「switchport trunk allowed vlan <VLAN番号群>」を使います。

```
S3(config)#int g0/1
S3(config-if)#switchport trunk allowed vlan 1,2  
```

この設定をすると、g0/1のインターフェースではVLAN1,2しかやりとりしないようになります。
それ以外の全てのVLAN宛のフレームが届いた場合は破棄しますし、
そのポートからVLAN1,2以外のフレームを出さないようになります。

アラウドVLANの設定も「show interface trunk」で確認できます。

```
S3#show int trunk

Port        Mode             Encapsulation  Status        Native vlan
Gi0/1       on               802.1q         trunking      1
Gi0/2       on               802.1q         trunking      1
Gi0/3       on               802.1q         trunking      1

Port        Vlans allowed on trunk
Gi0/1       1-2
Gi0/2       1-4094
Gi0/3       1-4094

Port        Vlans allowed and active in management domain
Gi0/1       1-2
Gi0/2       1-3
Gi0/3       1-3

Port        Vlans in spanning tree forwarding state and not pruned
Gi0/1       1-2
Gi0/2       1-3
Gi0/3       1-3
```


### ネイティブVLANの設定

最後に次のセクションのためにSW3のルーターに接続するポートG0/3で、
ネイティブVLANを変更します。
デフォルトのネイティブVLANはVLAN1であるため、VLAN1のフレームにはタグがついていません。
ただ、G0/3ではデフォルトVLANを全く利用しないVLAN99に割り当てます。
こうすることで、VLAN1にもタグがつけられるようになります。

```
switchport trunk native vlan 99
```

<<図>>

注意をして欲しいのはスイッチとスイッチを接続する場合は、
ネイティブVLANを必ず揃える必要があるということです。
たとえばスイッチAとスイッチBがつながっており、スイッチAのポートのネイティブVLANが10で、
スイッチBのネイティブVLANが20だとします。
このときスイッチAがVLAN10のフレームをスイッチBに転送すると、そのフレームはVLAN20に変化してしまいます。
繋がるべき通信ができなかったり、繋がるべきでない箇所が繋がるため、必ず揃えて下さい。
