# L3スイッチとネットワーク仮想化

{{ TOC }}

## 概要

あああ

## L3スイッチ

2000年より前はルーターとスイッチの役割が明確に分かれていました。
企業内でネットワークを作ろうと思えば、スイッチでネットワークを作り、ルーターでネットワークを繋ぐことが必須でした。

ただ、企業の中にスイッチとルーターを多数設置するのはコストも手間もかかるため、
ルーターとスイッチの両方の仕事ができる機器が求められ始めました。
L3スイッチはそのような背景のもとに生まれました。

L3スイッチは「スイッチ」と名前がついていることから分かるように、ルーターよりは今まで学んできたL2スイッチに似ています。
多くのポートを持っているので多数の機器を接続でき、なおかつハードウェアで転送処理を行うため、パケットの転送速度は高速です。
ただ、L2スイッチと違ってネットワーク間のパケット転送(ルーティング)や、ルーティングの下地を作るためのルーティングプロトコルなどを利用できます。
そのため、現在の業務用ネットワーク機器の主役はL3スイッチとなっています。

なお、L3スイッチはルーターとしてもL2スイッチとしても使うことはできますが、
ルーターもL2スイッチも依然として使われています。
L3スイッチはルーターとして販売されている製品ほど多くの機能を持っていない場合が多く、
例えばNATやVPNといった機能は多くのL3スイッチが提供していません。
これらが必要とされる場所ではルーターやルーター機能を持つファイアウォールが利用されます。
また、ルーティング機能がL3スイッチに求められないのであれば、L2スイッチが利用されます。
L3スイッチをL2スイッチとして利用することもできますが、L2スイッチのほうが安価です。


## L2ポートとL3ポート

ルーターやスイッチに存在するポートは同じイーサネットの口を持っています。
ただ、そのポートがL2転送のために使われるか、L3のために使われるかをきちんと認識する必要があります。
今まで学んできたことの復習もかねて動作を整理します。

L2スイッチが持つ「**L2ポート**」は同一ネットワーク内のフレーム転送に利用されます。
フレームを受け取った際にVLANを判別して、宛先MACアドレスに応じてL2転送を行います。
L2ポートにされる設定はL2転送に関わるものなので、VLAN周りの設定が中心となります。

一方、ルーターが持つ「**L3ポート**」は異なるネットワーク間でのパケット転送に利用されます。
自身が持つMACアドレス宛に転送されてきたパケットの宛先IPとルーティングテーブルを比較して、
ネクストホップアドレスに転送します。
L3ポートにされる設定はL3転送に必要となるIPアドレスやサブネットマスク、
ルーティングプロトコルの有効化などです。

![image](./0025_image/01.png)

L2スイッチにはL2ポートしかなく、ルーターにはL3ポートしかありません。
ただ、L3スイッチにはL2ポートもL3ポートもあります。
L3スイッチが持つポートは「ルーテッドポート」「SVI」の2つがあり、
L3ポートの間でだけルーティングが行われます。
逆に言えばL2ポートではルーティングされずにL2転送されるだけです。


## ルーテッドポート

L3スイッチの物理インターフェースには3種類の状態があります。
L2ポートとして動作する「アクセスポート」「トランクポート」及び、L3ポートとして動作する「**ルーテッドポート**」です。
L2ポートはまとめて「**スイッチポート**」とも呼ばれます。

![image](./0025_image/01.png)

L3スイッチのルーテッドポートの設定は、
まずインターフェースをスイッチポートからルーテッドポートに切り替えることから始まります。

```text
aaa(config)# interface interface-id
aaa(config-if)# no switchport
```

こうすることで、このポートはルータと同じようにL3の設定ができるようになります。
L3のポートですので、VLANなどのL2に関わる設定は無視されるか消えます。

```text
aaa(config-if)# ip address
```

ルーテッドポートは次に述べるSVIよりも論理的な構成が簡単になります。
ただ、冗長化などがSVIに比べると使いにくいため、利用される場面はそれほど多くありません。


## SVI

L3スイッチは「ルーターにスイッチの機能を加えた」というよりは「スイッチにルーターの機能を加えた」機器です。
VLANを使って複数のポートが同じネットワークに属しているため、
ルーテッドポートのように「ひとつのネットワークにひとつの物理ポートしか使えない」という構成は不便です。

「**SVI(Switch Virtual Interface)**」はVLANに対して仮想的にL3のインターフェースを作成するという仕組みです。
言葉で書くと複雑ですが、図で考えるとそれほど難しくありません。

![image](./0025_image/01.png)

L3インターフェースであるSVIはVLANに対して作られるため、そのVLANに繋がるホストは全てSVIに対してL2で間接的に接続されます。
ルーテッドポートはルーターのインターフェースと同じ役割に過ぎませんが、
SVIは「L2スイッチにルーターが繋がる構成」をひとつの機器内部で実現しています。

他のVLANにもSVIを作成することができ、L3ポートであるSVI間にて「**VLAN間ルーティング**」を行うことができます。
スイッチだけでネットワーク間でのルーティングができるようになるため、
特別な機能が求められない組織内部のネットワークはほとんどL3スイッチでまかなうことができるようになります。

ここでは以下の構成をSVIを使って実現します。

![image](./0025_image/01.png)



### SVIの設定

L3スイッチにSVIを作成します。
SVIの作成は「interface vlan <VLAN番号>」とします。
こうするとそのVLANにSVIが作成され、インターフェース設定モードに移行します。
すでにSVIが作られていた場合はインターフェース設定モードに移るだけです。

```
L3SW1(config)#int vlan 1
L3SW1(config-if)#ip address 10.0.1.1 255.255.255.0
L3SW1(config-if)#no shut
L3SW1(config-if)#int vlan 2
L3SW1(config-if)#ip add 10.0.2.1 255.255.255.0
L3SW1(config-if)#no shut
```

SVIを作成し、それにルーターのインターフェースと同じようにIPアドレスを与えました。
「show ip interface brief」でポート一覧を確認すると、Vlan1, Vlan2という新しいインターフェースが作成されてアップしていることが分かります。
設定したIPアドレスも与えられています。

```
L3SW1#show ip int bri
Interface              IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0     unassigned      YES unset  administratively down down    
GigabitEthernet0/1     unassigned      YES unset  up                    up      
GigabitEthernet0/2     unassigned      YES unset  up                    up      
Vlan1                  10.0.1.1        YES manual up                    up      
Vlan2                  10.0.2.1        YES manual up                    up    
```

これだけでSVIの作成は完了です。
VLAN1のPC1から、VLAN2のPC3にpingをすると成功するようになりました。

```
PC1#ping 10.0.2.103
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.2.103, timeout is 2 seconds:
.!!!!
```

この結果から分かるように、L3スイッチはL2スイッチのように同じネットワーク内のMACアドレスを使ったL2通信機能も提供し、
ルーターのように異なるネットワーク間でのパケットのルーティング機能も提供します。



### SVIでルーティングプロトコルを使う

SVIはルーターのインターフェースと同じように利用できますので、
第三章でお話したルーティングプロトコルを利用することもできます。
まだお話していない「ルーテッドポート」も絡めて使い方を確認してみます。

![image](./0025_image/01.png)




## ルーターのサブインターフェース

L3スイッチのSVIを使うことでVLAN間でのルーティングが実現できます。
現在はあまり多くないと思いますが、
手持ちの機器にL2スイッチとルーターしかない場合はルーターにVLAN感でのルーティングをさせることができます。

ルーターの設定で「このタグが付いたパケットはこのサブインターフェースで扱う」と設定すれば、
同じ物理インターフェースに対して届いたパケットであっても、
パケットのタグに応じて利用する「仮想的なインターフェースであるサブインターフェース」が変わります。

L2スイッチのトランクポート(複数のVLANが使える)と、
ルーターの「**サブインターフェース**」という「タグごとに仮想インターフェースが使える機能」を使ったポートを繋げることで、
VLAN間でのルーティングを少ないケーブルで実現できます。

![image](./0025_image/01.png)


```
R1(config)#int g0/1
R1(config-if)# no ip address
R1(config-if)# int g0/1.1
R1(config-subif)#encapsulation dot1Q 1
R1(config-subif)#ip address 10.0.2.1 255.255.255.0
R1(config)#int g0/1.2
R1(config-subif)#encapsulation dot1Q 2
R1(config-subif)#ip address 10.0.2.1 255.255.255.0
R1(config)#int g0/1.3
R1(config-subif)#encapsulation dot1Q 3
R1(config-subif)#ip address 10.0.3.1 255.255.255.0
```


R1#show ip int bri
Interface                  IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0         10.255.0.219    YES NVRAM  administratively down down    
GigabitEthernet0/1         10.0.1.1        YES NVRAM  up                    up      
GigabitEthernet0/1.2       10.0.2.1        YES manual up                    up      
GigabitEthernet0/1.3       10.0.3.1        YES manual up                    up      


なお、ルーターはスイッチとは異なるのでVLANという概念はありません。
ただ、IPアドレスやルーティングの制御といった管理面で捉えると、
サブインターフェースとVLAN番号とマッピングをしたほうがわかりやすいです。
そのため、私はサブインターフェースの番号はタグの番号、つまりVLANの番号を振るようにしています。
上記で言えば、VLAN1に対応するサブインターフェースは「X.1」、VLAN2であれば「X.2」となります。
同様にVLAN100であれば「X.100」を与えます。
