<!DOCTYPE html>
<html lang="en">
 <head>
  <meta charset="utf-8"/>
  <meta content="Sample Description" name="description"/>
  <link href="./assets/favicon.ico" rel="icon"/>
  <title>
   Network Boot Camp
  </title>
  <link href="./assets/css/bootstrap.css" rel="stylesheet">
   <link href="./assets/css/codehilite_colorful.css" rel="stylesheet"/>
  </link>
 </head>
 <body>
  <!-- GENERATED HTML START -->
  <h1>
   ルーターの仕事
  </h1>
  <h2>
   概要
  </h2>
  <p>
   インターネットは複数のネットワークから構成されています。
ブロードバンドルーターの仕事は「自宅内のネットワーク」と「外の全てのネットワーク」とのやりとりを中継することでした。
つまりブロードバンドルーターは2つのネットワークを中継する役割を持っています。
  </p>
  <p>
   業務用のルーターもブロードバンドルータと同じくネットワークとネットワークを繋ぐ仕事を担当しています。
ただ、家庭内のシンプルなネットワークを提供するブロードバンドルーターと違い、
たくさんのネットワークを繋げて通信させる複雑な機能を多く持っています。
本章ではルーターが提供するパケットを転送する仕組みに絞って解説をします。
  </p>
  <p>
   &lt;&lt;スイッチとルーターの違いの図&gt;&gt;
  </p>
  <p>
   スイッチは同じネットワーク内の機器同士でパケットを転送するために、MACアドレスを利用していました。
宛先MACアドレスとスイッチのインターフェスが対応付けられています。
  </p>
  <p>
   一方、ルーターはIPアドレスのネットワークアドレスを基準にしてパケットを転送します。
第一章でもお話したようにIPアドレスはネットワーク自体を表す「ネットワークアドレス」と、
ネットワーク内のホストを表す「ホストアドレス」があります。
一般的にIPアドレスというとホストアドレスのことをさしますが、
これに「どこまでがネットワークアドレスか」を表す「サブネットマスク」を適用するとネットワークアドレスが得られます。
  </p>
  <p>
   複数のネットワークが存在する環境では複数のルーターがスイッチを介して接続されているか、
ルーター同士が直接接続されていますので、自分が接続されているネットワーク宛のパケット以外を受け取った場合は、
お互いにどのルーターにパケットを送るか事前に決められています。
そのルールに従って複数のルーター間でパケットを転送しあうことで、パケットを宛先のネットワークまで送ります。
  </p>
  <h2>
   デフォルトゲートウェイ
  </h2>
  <p>
   実はPCにも簡易的なルーターの機能が搭載されており、「このネットワークあてのパケットはこのルーターに送る」という指定ができます。
ただ、通常はそのような細かい指定はせずに「デフォルトゲートウェイ」と呼ばれる機能のみを使います。
  </p>
  <p>
   デフォルトゲートウェイは「宛先のネットワークアドレスを知らない場合にパケットを送るアドレス」です。
これは家庭内のネットワークでも利用されていて、
ブロードバンドルーターに接続されたPCはDHCPでIPアドレスとサブネットマスクをもらうのと同時にデフォルトゲートウェイの指定も受けます。
デフォルトゲートウェイのアドレスにはブロードバンドルーターのIPが指定されています。
もしこれが設定されていないと、PCは自分が加わっているネットワーク以外には一切通信ができません。
  </p>
  <p>
   デフォルトゲートウェイは宛先のネットワークアドレスを知らない場合に利用されるということは、
逆に言えば自分が接続しているネットワークには利用されません。
なぜなら、PCはIPアドレスと同時にサブネットマスクも持っているため、自分がどのネットワークに接続されているかということを知っているからです。
そのため、自分が接続しているネットワークの他の機器のIPに対しては直接通信を行い、
それ以外のネットワークの機器が宛先の場合はパケットをデフォルトゲートウェイであるルーターに送るという動きをします。
  </p>
  <p>
   本書ではルーターをPCの代わりに利用していますので、ルーターにデフォルトゲートウェイの設定をして挙動を確かめてみます。
PCとルーターのインターフェースにIPが振られただけの状態の以下の図のネットワークを使います。
  </p>
  <p>
   &lt;&lt;図&gt;&gt;
  </p>
  <p>
   左側のPC1からルーターであるR1のG0/1インタフェースにPingは届きますが、R1のG0/2やPC2には届きません。
  </p>
  <div class="codehilite">
   <pre><span></span>PC1#ping 10.0.1.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.1.1, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 4/4/6 ms

PC1#ping 10.0.2.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.2.1, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)

PC1#ping 10.0.2.102
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.2.102, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
</pre>
  </div>
  <p>
   PC1とR1のG0/1は同じネットワークであるため、先の章で学んだ「MACアドレスとARPを用いる同一セグメントの通信」ができます。
一方、PC1とPC2は異なるセグメントであるためこれが使えません。
人間がこの図を見れば、ルーターであるR1を経由して「PC1 -&gt; R1のG0/1 -&gt; R1のG0/2 -&gt; PC2」とパケットを中継すればよいと分かります。
ただ、デフォルトルートが設定されていないPCにとって、ルータR1は単なる機器と同じであるためこれがパケット転送をできることを知りません。
  </p>
  <p>
   この状況を打開するために、
デフォルトルートとして「デフォルトのパケットの宛先をR1のG0/1インタフェースのIPである10.0.1.1にする」とPCに設定をします。
WindowsやMACなどですとデフォルトルートをプロパティなどからGUIで設定しますが、
CiscoのRouterですと以下のようなコマンドを使います。
  </p>
  <div class="codehilite">
   <pre><span></span>PC1#conf t
PC1(config)#ip route 0.0.0.0 0.0.0.0 10.0.1.1
PC1(config)#end
</pre>
  </div>
  <p>
   このコマンドを打つと、PCとして利用しているCiscoのルーターは「自分が属するネットワークあてであればL2転送を行う」
「宛先ネットワークへどう届ければいいか分からないパケットはとりあえず10.0.1.1に届ける」と動くようになります。
  </p>
  <p>
   この状態でpingをすると、R1の反対側のインタフェースであるG0/2にはPingが届くようになります。
ただ、PC2宛のpingは相変わらず失敗しています。
  </p>
  <div class="codehilite">
   <pre><span></span>PC1#ping 10.0.2.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.2.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/5/7 ms

PC1#ping 10.0.2.102
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.2.102, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
</pre>
  </div>
  <p>
   これは単純な話で、PC2には実はPingのパケットが届いているものの、
PC2がPC1という宛先にどうパケットを送ればいいか分からずに、Pingパケットを送り返せていないためです。
そのため、先ほどのPC1と同じように、PC2にもデフォルトルートを設定すればPC2からPC1宛に応答パケットを返せるようにします。
これでPC1のPingが成功します。
  </p>
  <div class="codehilite">
   <pre><span></span>PC2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PC2(config)#ip route 0.0.0.0 0.0.0.0 10.0.2.1
PC2(config)#end
PC2#

PC1#ping 10.0.2.102
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.2.102, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 5/6/7 ms
</pre>
  </div>
  <p>
   以上がデフォルトゲートウェイの仕組みでした。
次のセクションでは、このデフォルトゲートウェイの仕組みを複雑にしたルーティングの仕組みを説明します。
  </p>
  <h1>
   ルーティングの仕組み
  </h1>
  <p>
   デフォルトゲートウェイを使った他のネットワークへのパケット転送は最も簡単なルーティングの仕組みです。
ルーターはこれをもう少し複雑にした仕組みにしたがってパケットを転送しています。
  </p>
  <p>
   例えば以下のようなネットワークがあるとしましょう。
  </p>
  <p>
   &lt;&lt;図&gt;&gt;
  </p>
  <p>
   PC1 -- Switch -- Router --- Router --- Switch -- PC2
                                   --- PC3
                            Router --- PC4
  </p>
  <p>
   PC1からPC2への通信と、PC3への通信は利用される経路が違います。
PC1からRouter1へはデフォルトゲートウェイとして転送されるだけですが、
Router1から最終的な宛先ネットワークに送るためには「どのルーターに転送するか」ということを知っている必要があります。
たとえばPC2が属するネットワーク「」に送るためにはRouter2に転送し、
PC3が属するネットワーク「」もRouter2に転送、PC4が属するネットワークはRouter3に転送という具合です。
ルーターもPCのデフォルトゲートウェイと同じように宛先が分からない場合に送るデフォルトの宛先を設定することができ、
ここではそれをインターネットに接続されているRouter0としています。
  </p>
  <p>
   PC1&gt;ping 10.0.1.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 2/3/6 ms
PC1&gt;ping 10.0.99.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.99.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 2/4/7 ms
PC1&gt;ping 10.0.99.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.99.2, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
PC1&gt;ping 10.0.2.102
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.2.102, timeout is 2 seconds:
U.U.U
Success rate is 0 percent (0/5)
  </p>
  <p>
   R1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR
  </p>
  <p>
   Gateway of last resort is not set
  </p>
  <div class="codehilite">
   <pre><span></span>  10.0.0.0/8 is variably subnetted, 4 subnets, 2 masks
</pre>
  </div>
  <p>
   C        10.0.1.0/24 is directly connected, GigabitEthernet0/1
L        10.0.1.1/32 is directly connected, GigabitEthernet0/1
C        10.0.99.0/24 is directly connected, GigabitEthernet0/2
L        10.0.99.1/32 is directly connected, GigabitEthernet0/2
  </p>
  <p>
   R1#conf t
R1(config)#ip route 10.0.2.0 255.255.255.0 10.0.99.2
R1(config)#ip route 10.0.3.0 255.255.255.0 10.0.99.3
R1(config)#ip route 10.0.4.0 255.255.255.0 10.0.99.3
  </p>
  <p>
   R1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR
  </p>
  <p>
   Gateway of last resort is not set
  </p>
  <div class="codehilite">
   <pre><span></span>  10.0.0.0/8 is variably subnetted, 7 subnets, 2 masks
</pre>
  </div>
  <p>
   C        10.0.1.0/24 is directly connected, GigabitEthernet0/1
L        10.0.1.1/32 is directly connected, GigabitEthernet0/1
S        10.0.2.0/24 [1/0] via 10.0.99.2
S        10.0.3.0/24 [1/0] via 10.0.99.3
S        10.0.4.0/24 [1/0] via 10.0.99.3
C        10.0.99.0/24 is directly connected, GigabitEthernet0/2
L        10.0.99.1/32 is directly connected, GigabitEthernet0/2
  </p>
  <p>
   R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#ip route 10.0.1.0 255.255.255.0 10.0.99.1
R2(config)#ip route 10.0.3.0 255.255.255.0 10.0.99.3
R2(config)#ip route 10.0.4.0 255.255.255.0 10.0.99.3
R2(config)#end
R2#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR
  </p>
  <p>
   Gateway of last resort is not set
  </p>
  <div class="codehilite">
   <pre><span></span>  10.0.0.0/8 is variably subnetted, 7 subnets, 2 masks
</pre>
  </div>
  <p>
   S        10.0.1.0/24 [1/0] via 10.0.99.1
C        10.0.2.0/24 is directly connected, GigabitEthernet0/1
L        10.0.2.1/32 is directly connected, GigabitEthernet0/1
S        10.0.3.0/24 [1/0] via 10.0.99.3
S        10.0.4.0/24 [1/0] via 10.0.99.3
C        10.0.99.0/24 is directly connected, GigabitEthernet0/2
L        10.0.99.2/32 is directly connected, GigabitEthernet0/2
  </p>
  <p>
   R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#ip route 10.0.1.0 255.255.255.0 10.0.99.1
R3(config)#ip route 10.0.2.0 255.255.255.0 10.0.99.2
R3(config)#end
R3#
R3#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR
  </p>
  <p>
   Gateway of last resort is not set
  </p>
  <div class="codehilite">
   <pre><span></span>  10.0.0.0/8 is variably subnetted, 8 subnets, 2 masks
</pre>
  </div>
  <p>
   S        10.0.1.0/24 [1/0] via 10.0.99.1
S        10.0.2.0/24 [1/0] via 10.0.99.2
C        10.0.3.0/24 is directly connected, GigabitEthernet0/1
L        10.0.3.1/32 is directly connected, GigabitEthernet0/1
C        10.0.4.0/24 is directly connected, GigabitEthernet0/2
L        10.0.4.1/32 is directly connected, GigabitEthernet0/2
C        10.0.99.0/24 is directly connected, GigabitEthernet0/3
L        10.0.99.3/32 is directly connected, GigabitEthernet0/3
  </p>
  <p>
   PC1&gt;ping 10.0.99.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.99.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 7/9/15 ms
PC1&gt;ping 10.0.2.102
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.2.102, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 14/16/20 ms
PC1&gt;ping 10.0.2.103
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.2.103, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 7/14/25 ms
PC1&gt;ping 10.0.3.104
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.3.104, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 8/11/16 ms
PC1&gt;ping 10.0.4.105
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.4.105, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 15/26/42 ms
  </p>
  <p>
   R1#show ip arp
Protocol  Address          Age (min)  Hardware Addr   Type   Interface
Internet  10.0.1.1                -   fa16.3eb5.d36a  ARPA   GigabitEthernet0/1
Internet  10.0.1.101             12   fa16.3ea2.6334  ARPA   GigabitEthernet0/1
Internet  10.0.99.1               -   fa16.3e1d.4a85  ARPA   GigabitEthernet0/2
Internet  10.0.99.2               4   fa16.3ed0.b70e  ARPA   GigabitEthernet0/2
Internet  10.0.99.3               6   fa16.3eba.e89c  ARPA   GigabitEthernet0/2
  </p>
  <p>
   S1#show mac address-table
          Mac Address Table
  </p>
  <hr/>
  <p>
   Vlan    Mac Address       Type        Ports
----    -----------       --------    -----
   1    fa16.3e1d.4a85    DYNAMIC     Gi0/1
   1    fa16.3eba.e89c    DYNAMIC     Gi0/3
   1    fa16.3ed0.b70e    DYNAMIC     Gi0/2
  </p>
  <p>
   この「ネットワークXへの通信を宛先X」に転送するという情報を管理しているのが「ルーティングテーブル」です。
MACアドレステーブルが宛先MACと出力ポートを管理していたように、
ルーティングテーブルは「宛先ネットワークと"転送するIPもしくはインターフェース"」をテーブルとして管理しています。
  </p>
  <p>
   宛先ネットワークが自分が接続されるネットワークであれば、そのインターフェースからパケットを送ります。
もし直接接続されていないネットワークであれば、転送するIPに対してパケットを送ります。
ルーターからルーターに転送することを繰り返して、最終的に宛先のネットワークまでパケットが届けられます。
上記のネットワークでルーティングテーブルがどのようになっているか、以下の図に記載します。
  </p>
  <p>
   &lt;&lt;図&gt;&gt;
  </p>
  <p>
   なお、ルーティングテーブルに記載されていないネットワーク宛のパケットはルーターが破棄します。
スイッチが宛先を知らないパケットを全てのポートから拡散したのは、
1つのネットワークという狭い範囲の中で宛先がどこかのポートの先にあるかもしれないからです。
ルーターでも接続されるルーター全てにパケットを拡散すれば宛先に届くかもしれませんが、
そのようなことをすると宛先不明のパケットが世界中で繋がるルーター間で無限に拡散しあうことになります。
そのため、ルーターでのパケット転送においては宛先不明のパケットは破棄すると決められています。
ただ、実際のネットワークではデフォルトルート(宛先不明の際に転送するアドレス)が設定されますので、
組織内のネットワークのみルーティングテーブルで管理し、それにない宛先はインターネットに対して転送するのが一般的です。
このあたりの話は第七章の「インターネットの仕組み」にて説明します。
  </p>
  <p>
   ルーティングテーブルの仕組みをおおまかに分かって頂けたかと思いますので、
ここからは実際に機器を操作してネットワークを構築し、機器がどのようにルーティングテーブルを管理しているか実際に確認します。
  </p>
  <p>
   ルーティングテーブルの構築は大まかに2つあり、
管理者が手動で設定するものと、ルーティングプロトコルを使ってルーター同士で互いに教え合うというものです。
ルーティングプロトコルは次のセクションで扱うため、ここでは手動で設定を行う「スタティックルート」という手法を使います。
スタティックルートの設定コマンドは「ip route XXXX YYYY ZZZZ」というもので、
これをすると XXXX のネットワークアドレス(サブネットマスクがYYYY)宛の通信はZZZZに送るという
ルーティングテーブルのルール(エントリ)を作れます。
なお、自分が直接接続されているルーティングテーブルのエントリはインターフェースにIPアドレスを与えた時点で勝手に作成されますので、
コマンドでルーティングテーブルにエントリを追加する必要はありません。
  </p>
  <p>
   先ほどの図を参考にRouter1,2,3にそれぞれ以下の設定を与えます。
  </p>
  <div class="codehilite">
   <pre><span></span>
</pre>
  </div>
  <p>
   実際の機器のルーティングテーブルを確認してみます。
  </p>
  <div class="codehilite">
   <pre><span></span>
</pre>
  </div>
  <p>
   このようにしてルーターに対してパケットをどのように転送するかというルールを定義できます。
  </p>
  <p>
   なお、ルーティングテーブルのことをRIBやFIBと呼ぶことがありますが、
RIBはソフトウェアが持つテーブルで、FIBはソフトウェアで作ったRIBをハードウェアに落とし込んだテーブルとなります。
現在の機器は高速にパケット転送を行うために様々な仕組みを使っているため、
ルーティングテーブルもかなり複雑な仕組みで利用されています。
ただ、その仕組は使う機器のベンダや型番によって異なりますので、普通のネットワーク管理者は気を配る必要はありません。
  </p>
  <h1>
   ルーティングプロトコルを使った経路学習
  </h1>
  <p>
   先ほどのネットワークはシンプルな構成であったため手動で管理するのはそれほど難しくありません。
ただ、ネットワーク全体の規模が大きくなってきた場合に手動で全てを管理するには限界があります。
例えば100台のルーターが複雑に接続されていて、1000個のネットワークがそこに存在する環境を想像してください。
全てのルーターで全てのネットワークを手動で設定していくことなど不可能です。
仮に数日かけて設定したとしても、ネットワークの変更や追加が必要になった場合の対応は複雑すぎてトラブル無しに行うことが難しいでしょう。
  </p>
  <p>
   ネットワーク管理者が経路情報を手動で管理するのではなく、
「ルーターがお互いにネットワークへの到達経路を教え合う」ことでこの問題は解決できます。
この仕組を実現するのが「ルーティングプロトコル」です。
  </p>
  <p>
   &lt;&lt;図&gt;&gt;
  </p>
  <p>
   ルーティングプロトコルには大きく分けると「組織内で使われるプロトコル」と「組織間(つまりインターネット)で使われるプロトコル」があります。
前者で有名なプロトコルですとRIPやOSPF、EIGRPなどがあり、後者はBGPしか一般的には使われていません。
ただ、数百社の企業のネットワークを何年も見てきましたが、はっきりいうとOSPF以外は一般企業はほとんど使っていません。
従業員数1万人以上の大企業や、ネットワークそのものを商売にしている企業を除けば、
BGPも使っていないところがほとんどです(つまりインターネットへの接続は全てサービスプロバイダー任せということ)。
  </p>
  <p>
   そのため、この章ではOSPFを使った経路情報の交換の仕組みについてしか扱いません。
OSPFにも様々な機能がありますが、多くの機能はルーティングの本質に関わらないものですので、それらも全て扱いません。
Ciscoの試験対策などですと様々な複雑な機能の詳細を覚えている必要があり、実際の業務でもそれらを必要とすることは稀にあります。
ただ、そういった些末な機能を使う時点でネットワークの設計として、どこかおかしなところがあります。
知っていると使ってみたくなるかもしれませんが、
それよりも拡張性の高いシンプルなネットワークを構築することを心がけてください。
  </p>
  <p>
   ここでは以下のようなネットワークを題材にしてOSPFの仕組みについて説明し、
その後で実際に機器に設定を加えて、どのようなルーティングテーブルが構築されるか確認します。
中心にいるルーターがコアとなって、それに他のルーターがぶらさがっているという構成です。
これに冗長化を加えれば、よく採用される企業のネットワークの形になります。
  </p>
  <p>
   &lt;&lt;図&gt;&gt;
  </p>
  <p>
   ルーティングプロトコルを使ったルーティングテーブルの構築は、ルーター同士の伝言ゲームです。
プロトコルというルールにしたがって、お互いにどういうような経路情報を持っているかを教え合い、
それらの情報からそれぞれの機器がルーティングテーブルを構築します。
  </p>
  <p>
   そのため、おおまかには以下の流れでルーティングテーブルを構築しています。
  </p>
  <ol>
   <li>
    同一ネットワークに属するルーター同士でネイバー関係(お互いに情報を教え合う)を結ぶ
   </li>
   <li>
    ルーターでアドバタイズするインターフェースを選択する
   </li>
   <li>
    指定したインターフェースのネットワークアドレスを隣接するルーターにアドバタイズ
   </li>
   <li>
    アドバタイズを受け取った機器はその経路が最短であれば採用し、隣接する他の機器にさらにアドバタイズする(最短経路でなければアドバタイズしない)
   </li>
   <li>
    上記を繰り返すことでネットワーク全体で経路情報を構築する
   </li>
  </ol>
  <p>
   上記のステップ2の「最短経路」は、あるネットワークにたどり着くための経路が複数ある場合の一番近い経路です。
どういったルートを短いと判断するかはルーティングプロトコル次第で、例えばRIPですと間にあるルーターの台数が基準となります。
OSPFはRIPより賢く、間のルーターの数ではなくネットワークの帯域(100Mbps, 1Gbpsなど)と、ルーターの台数の両方を基準にします。
特別な状況でない限りルーターの台数が増えても太い帯域の経路をOSPFは選びますが、その経路の選択には厳密なアルゴリズムがあります。
  </p>
  <p>
   ただ、一般的にはOSPFを利用するルーターは規則的に配置するため、
OSPFの経路選択アルゴリズムを知らなくてもどのようなルートを通って通信するか簡単に推測できる場合がほとんどです。
ルーターとルーターを不規則に接続するようなネットワークでもOSPFによるルーティングは正しく動くでしょうが、
そのようなネットワークはデザインとして間違っているので構築しないでください。
  </p>
  <p>
   それでは上記図に記載したとおりにルーターに設置を加えていきます。
  </p>
  <div class="codehilite">
   <pre><span></span>R1(config)#router ospf 1
R1(config-router)#

R1(config-router)#int g0/1
R1(config-if)#ip ospf 1 area 0
R1(config-if)#int g0/2
R1(config-if)#ip ospf 1 area 0
</pre>
  </div>
  <div class="codehilite">
   <pre><span></span>R2(config)#router ospf 1
R2(config-router)#int g0/1
R2(config-if)#ip ospf 1 area 0
R2(config-if)#int g0/2
R2(config-if)#ip ospf 1 area 0
R2(config-if)#
*Oct 29 01:00:17.295: %OSPF-5-ADJCHG: Process 1, Nbr 10.0.99.1 on GigabitEthernet0/2 from LOADING to FULL, Loading Done
R2(config-if)#end
</pre>
  </div>
  <div class="codehilite">
   <pre><span></span>R1(config-if)#
*Oct 29 01:00:07.677: %OSPF-5-ADJCHG: Process 1, Nbr 10.0.99.2 on GigabitEthernet0/2 from LOADING to FULL, Loading Done
R1(config-if)#end

R1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR

Gateway of last resort is not set

      10.0.0.0/8 is variably subnetted, 5 subnets, 2 masks
C        10.0.1.0/24 is directly connected, GigabitEthernet0/1
L        10.0.1.1/32 is directly connected, GigabitEthernet0/1
O        10.0.2.0/24 [110/2] via 10.0.99.2, 00:00:23, GigabitEthernet0/2
C        10.0.99.0/24 is directly connected, GigabitEthernet0/2
L        10.0.99.1/32 is directly connected, GigabitEthernet0/2
</pre>
  </div>
  <div class="codehilite">
   <pre><span></span>R3(config-if)#int g0/1
R3(config-if)#ip ospf 1 area 0
R3(config-if)#int g0/2
R3(config-if)#ip ospf 1 area 0
R3(config-if)#int g0/3
R3(config-if)#ip ospf 1 area 0
R3(config-if)#
*Oct 29 01:08:37.725: %OSPF-5-ADJCHG: Process 1, Nbr 10.0.99.1 on GigabitEthernet0/3 from LOADING to FULL, Loading Done
*Oct 29 01:08:37.725: %OSPF-5-ADJCHG: Process 1, Nbr 10.0.99.2 on GigabitEthernet0/3 from LOADING to FULL, Loading Done
</pre>
  </div>
  <div class="codehilite">
   <pre><span></span>R1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR

Gateway of last resort is not set

      10.0.0.0/8 is variably subnetted, 7 subnets, 2 masks
C        10.0.1.0/24 is directly connected, GigabitEthernet0/1
L        10.0.1.1/32 is directly connected, GigabitEthernet0/1
O        10.0.2.0/24 [110/2] via 10.0.99.2, 00:09:01, GigabitEthernet0/2
O        10.0.3.0/24 [110/2] via 10.0.99.3, 00:00:37, GigabitEthernet0/2
O        10.0.4.0/24 [110/2] via 10.0.99.3, 00:00:37, GigabitEthernet0/2
C        10.0.99.0/24 is directly connected, GigabitEthernet0/2
L        10.0.99.1/32 is directly connected, GigabitEthernet0/2

R1#show ip route ospf
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR

Gateway of last resort is not set

      10.0.0.0/8 is variably subnetted, 7 subnets, 2 masks
O        10.0.2.0/24 [110/2] via 10.0.99.2, 00:31:06, GigabitEthernet0/2
O        10.0.3.0/24 [110/2] via 10.0.99.3, 00:22:42, GigabitEthernet0/2
O        10.0.4.0/24 [110/2] via 10.0.99.3, 00:22:42, GigabitEthernet0/2
</pre>
  </div>
  <div class="codehilite">
   <pre><span></span>R1#show ip ospf interface brief
Interface    PID   Area            IP Address/Mask    Cost  State Nbrs F/C
Gi0/2        1     0               10.0.99.1/24       1     DR    2/2
Gi0/1        1     0               10.0.1.1/24        1     DR    0/0

R1#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
10.0.99.2         1   FULL/BDR        00:00:34    10.0.99.2       GigabitEthernet0/2
10.0.99.3         1   FULL/DROTHER    00:00:31    10.0.99.3       GigabitEthernet0/2
</pre>
  </div>
  <h1>
   経路集約
  </h1>
  <p>
   ルーティングプロトコルを使うことでルーター同士がお互いに経路情報を交換するため、
簡単に複雑なネットワークでパケット転送がうまくいく状態にできます。
ただ、そのようなネットワークの設計は間違っているため、通常は「経路集約」を念頭においたネットワークの設計をします。
  </p>
  <p>
   経路集約は「連続した小さな複数のネットワーク」を「大きな一つのネットワーク」として外に見せるテクニックです。
これを使うことでルーティングテーブルに記載されるエントリの数が減らせるので、ネットワークを管理しやすくなります。
ただ、「連続した」とあるようにネットワークの設計をする際にレンジが近いネットワークアドレスを固める必要があります。
  </p>
  <p>
   具体例として東京に本社を持ち、日本全国に支店を持つ会社でOSPFを使って経路情報を交換するというシナリオを考えます。
社内アドレスとして10.0.0.0/8を利用します。
  </p>
  <p>
   10.0.0.0/8を切り出して、/24のネットワークを必要になったタイミングで各拠点に割りあて、
足りなくなったら追加で増設するというルールでネットワークの運用をしていたとしましょう。
すると以下のような社内ネットワークが構築されることになります。
  </p>
  <p>
   &lt;&lt;図&gt;&gt;
  </p>
  <p>
   このようなネットワークを構築すると、それぞれの拠点が持つ全ての/24のネットワークをお互いに教え合う必要があります。
  </p>
  <p>
   一方、各拠点に/16のネットワークを事前に割り当てて、それを拠点内で分割するというルールでネットワークを運用したとします。
  </p>
  <p>
   &lt;&lt;図&gt;&gt;
  </p>
  <p>
   このようなネットワークを作ると経路を集約することができます。
例えば大阪にあるPCが東京にあるサーバーに通信をする場合、
大阪にあるルーターは宛先アドレスを見て「10.1.0.0/16」のアドレスであれば、
とりあえず東京に送って後は東京のルーターに任せるということができます。
  </p>
  <p>
   PC_OKNW1#ping 10.1.1.101
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.1.101, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 12/16/25 ms
PC_OKNW1#ping 10.1.2.102
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.2.102, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 12/17/25 ms
PC_OKNW1#ping 10.2.1.101
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.2.1.101, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 10/13/19 ms
PC_OKNW1#ping 10.2.2.102
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.2.2.102, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 12/13/16 ms
  </p>
  <p>
   R_TKY1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR
  </p>
  <p>
   Gateway of last resort is not set
  </p>
  <div class="codehilite">
   <pre><span></span>  10.0.0.0/8 is variably subnetted, 10 subnets, 2 masks
</pre>
  </div>
  <p>
   C        10.0.0.0/24 is directly connected, GigabitEthernet0/1
L        10.0.0.1/32 is directly connected, GigabitEthernet0/1
C        10.1.0.0/24 is directly connected, GigabitEthernet0/2
L        10.1.0.1/32 is directly connected, GigabitEthernet0/2
O        10.1.1.0/24 [110/2] via 10.1.0.2, 00:26:48, GigabitEthernet0/2
O        10.1.2.0/24 [110/2] via 10.1.0.3, 00:27:16, GigabitEthernet0/2
O IA     10.2.0.0/24 [110/2] via 10.0.0.2, 00:19:00, GigabitEthernet0/1
O IA     10.2.1.0/24 [110/3] via 10.0.0.2, 00:14:24, GigabitEthernet0/1
O IA     10.2.2.0/24 [110/3] via 10.0.0.2, 00:14:14, GigabitEthernet0/1
O IA     10.3.0.0/24 [110/2] via 10.0.0.3, 00:09:59, GigabitEthernet0/1
  </p>
  <p>
   R_OKNW1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR
  </p>
  <p>
   Gateway of last resort is not set
  </p>
  <div class="codehilite">
   <pre><span></span>  10.0.0.0/8 is variably subnetted, 10 subnets, 2 masks
</pre>
  </div>
  <p>
   C        10.0.0.0/24 is directly connected, GigabitEthernet0/1
L        10.0.0.3/32 is directly connected, GigabitEthernet0/1
O IA     10.1.0.0/24 [110/2] via 10.0.0.1, 00:08:32, GigabitEthernet0/1
O IA     10.1.1.0/24 [110/3] via 10.0.0.1, 00:08:32, GigabitEthernet0/1
O IA     10.1.2.0/24 [110/3] via 10.0.0.1, 00:08:32, GigabitEthernet0/1
O IA     10.2.0.0/24 [110/2] via 10.0.0.2, 00:08:32, GigabitEthernet0/1
O IA     10.2.1.0/24 [110/3] via 10.0.0.2, 00:08:32, GigabitEthernet0/1
O IA     10.2.2.0/24 [110/3] via 10.0.0.2, 00:08:32, GigabitEthernet0/1
C        10.3.0.0/24 is directly connected, GigabitEthernet0/2
L        10.3.0.1/32 is directly connected, GigabitEthernet0/2
  </p>
  <p>
   R_TKY2#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR
  </p>
  <p>
   Gateway of last resort is not set
  </p>
  <div class="codehilite">
   <pre><span></span>  10.0.0.0/8 is variably subnetted, 10 subnets, 2 masks
</pre>
  </div>
  <p>
   O IA     10.0.0.0/24 [110/2] via 10.1.0.1, 00:29:33, GigabitEthernet0/1
C        10.1.0.0/24 is directly connected, GigabitEthernet0/1
L        10.1.0.2/32 is directly connected, GigabitEthernet0/1
C        10.1.1.0/24 is directly connected, GigabitEthernet0/2
L        10.1.1.1/32 is directly connected, GigabitEthernet0/2
O        10.1.2.0/24 [110/2] via 10.1.0.3, 00:29:33, GigabitEthernet0/1
O IA     10.2.0.0/24 [110/3] via 10.1.0.1, 00:21:49, GigabitEthernet0/1
O IA     10.2.1.0/24 [110/4] via 10.1.0.1, 00:17:12, GigabitEthernet0/1
O IA     10.2.2.0/24 [110/4] via 10.1.0.1, 00:17:01, GigabitEthernet0/1
O IA     10.3.0.0/24 [110/3] via 10.1.0.1, 00:12:46, GigabitEthernet0/1
  </p>
  <p>
   PC_OKNW1#ping 10.1.1.101
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.1.101, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 25/37/52 ms
PC_OKNW1#ping 10.1.2.102
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.2.102, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 11/17/31 ms
PC_OKNW1#ping 10.2.1.101
   <br/>
   Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.2.1.101, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 15/27/53 ms
PC_OKNW1#ping 10.2.2.102
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.2.2.102, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 7/11/14 ms
  </p>
  <p>
   R_OKNW1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR
  </p>
  <p>
   Gateway of last resort is not set
  </p>
  <div class="codehilite">
   <pre><span></span>  10.0.0.0/8 is variably subnetted, 7 subnets, 3 masks
</pre>
  </div>
  <p>
   C        10.0.0.0/24 is directly connected, GigabitEthernet0/1
L        10.0.0.3/32 is directly connected, GigabitEthernet0/1
O IA     10.1.0.0/16 [110/2] via 10.0.0.1, 00:20:36, GigabitEthernet0/1
O IA     10.2.0.0/16 [110/2] via 10.0.0.2, 00:17:17, GigabitEthernet0/1
O        10.3.0.0/16 is a summary, 00:20:36, Null0
C        10.3.0.0/24 is directly connected, GigabitEthernet0/2
L        10.3.0.1/32 is directly connected, GigabitEthernet0/2
  </p>
  <p>
   R_TKY1#show ip route
   <br/>
   Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR
  </p>
  <p>
   Gateway of last resort is not set
  </p>
  <div class="codehilite">
   <pre><span></span>  10.0.0.0/8 is variably subnetted, 9 subnets, 3 masks
</pre>
  </div>
  <p>
   C        10.0.0.0/24 is directly connected, GigabitEthernet0/1
L        10.0.0.1/32 is directly connected, GigabitEthernet0/1
O        10.1.0.0/16 is a summary, 00:06:53, Null0
C        10.1.0.0/24 is directly connected, GigabitEthernet0/2
L        10.1.0.1/32 is directly connected, GigabitEthernet0/2
O        10.1.1.0/24 [110/2] via 10.1.0.2, 00:06:03, GigabitEthernet0/2
O        10.1.2.0/24 [110/2] via 10.1.0.3, 00:06:16, GigabitEthernet0/2
O IA     10.2.0.0/16 [110/2] via 10.0.0.2, 00:06:16, GigabitEthernet0/1
O IA     10.3.0.0/16 [110/2] via 10.0.0.3, 00:06:16, GigabitEthernet0/1
  </p>
  <p>
   R_TKY2#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR
  </p>
  <p>
   Gateway of last resort is not set
  </p>
  <div class="codehilite">
   <pre><span></span>  10.0.0.0/8 is variably subnetted, 8 subnets, 3 masks
</pre>
  </div>
  <p>
   O IA     10.0.0.0/24 [110/2] via 10.1.0.1, 00:05:31, GigabitEthernet0/1
C        10.1.0.0/24 is directly connected, GigabitEthernet0/1
L        10.1.0.2/32 is directly connected, GigabitEthernet0/1
C        10.1.1.0/24 is directly connected, GigabitEthernet0/2
L        10.1.1.1/32 is directly connected, GigabitEthernet0/2
O        10.1.2.0/24 [110/2] via 10.1.0.3, 00:05:31, GigabitEthernet0/1
O IA     10.2.0.0/16 [110/3] via 10.1.0.1, 00:05:31, GigabitEthernet0/1
O IA     10.3.0.0/16 [110/3] via 10.1.0.1, 00:05:31, GigabitEthernet0/1
  </p>
  <h1>
   経路選択アルゴリズム
  </h1>
  <p>
   ルーターが学習する経路情報
  </p>
  <p>
   ルーティングテーブルを見ただけでどのようにルーティングされるか分かるようなネットワークを作るべきですが、
  </p>
  <ul>
   <li>
    プレフィックス長
   </li>
   <li>
    AD値
   </li>
   <li>
    メトリック
   </li>
  </ul>
  <p>
   R1#show ip route 10.2.0.0
Routing entry for 10.2.0.0/24
 Known via "ospf 1", distance 110, metric 3, type inter area
 Last update from 10.0.4.4 on GigabitEthernet0/3, 00:00:49 ago
 Routing Descriptor Blocks:
 * 10.0.4.4, from 10.2.0.1, 00:00:49 ago, via GigabitEthernet0/3
     Route metric is 3, traffic share count is 1
R1#
R1#
R1#show ip route 10.2.0.0
Routing entry for 10.2.0.0/24
 Known via "ospf 1", distance 110, metric 4, type inter area
 Last update from 10.0.1.2 on GigabitEthernet0/2, 00:02:59 ago
 Routing Descriptor Blocks:
 * 10.0.1.2, from 10.2.0.1, 00:02:59 ago, via GigabitEthernet0/2
     Route metric is 4, traffic share count is 1
  </p>
  <p>
   aa
  </p>
  <p>
   R1#show ip route 10.2.0.0
Routing entry for 10.2.0.0/24
  Known via "static", distance 1, metric 0
  Routing Descriptor Blocks:
  * 10.0.4.4
      Route metric is 0, traffic share count is 1
  </p>
  <p>
   R1#show ip route 10.2.0.0
Routing entry for 10.2.0.0/24
  Known via "ospf 1", distance 110, metric 4, type inter area
  Last update from 10.0.1.2 on GigabitEthernet0/2, 00:25:25 ago
  Routing Descriptor Blocks:
  * 10.0.1.2, from 10.2.0.1, 00:25:25 ago, via GigabitEthernet0/2
      Route metric is 4, traffic share count is 1
  </p>
  <p>
   ip route を追加
  </p>
  <p>
   R1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR
  </p>
  <p>
   Gateway of last resort is not set
  </p>
  <div class="codehilite">
   <pre><span></span>  10.0.0.0/8 is variably subnetted, 10 subnets, 2 masks
</pre>
  </div>
  <p>
   C        10.0.1.0/24 is directly connected, GigabitEthernet0/2
L        10.0.1.1/32 is directly connected, GigabitEthernet0/2
O        10.0.2.0/24 [110/2] via 10.0.1.2, 01:31:52, GigabitEthernet0/2
O        10.0.3.0/24 [110/3] via 10.0.1.2, 01:31:32, GigabitEthernet0/2
C        10.0.4.0/24 is directly connected, GigabitEthernet0/3
L        10.0.4.1/32 is directly connected, GigabitEthernet0/3
O        10.0.5.0/24 [110/4] via 10.0.1.2, 01:12:53, GigabitEthernet0/2
C        10.1.0.0/24 is directly connected, GigabitEthernet0/1
L        10.1.0.1/32 is directly connected, GigabitEthernet0/1
S        10.2.0.0/24 [1/0] via 10.0.4.4
  </p>
  <p>
   ip route を/16変更
  </p>
  <p>
   R1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR
  </p>
  <p>
   Gateway of last resort is not set
  </p>
  <div class="codehilite">
   <pre><span></span>  10.0.0.0/8 is variably subnetted, 11 subnets, 3 masks
</pre>
  </div>
  <p>
   C        10.0.1.0/24 is directly connected, GigabitEthernet0/2
L        10.0.1.1/32 is directly connected, GigabitEthernet0/2
O        10.0.2.0/24 [110/2] via 10.0.1.2, 01:44:53, GigabitEthernet0/2
O        10.0.3.0/24 [110/3] via 10.0.1.2, 01:44:33, GigabitEthernet0/2
C        10.0.4.0/24 is directly connected, GigabitEthernet0/3
L        10.0.4.1/32 is directly connected, GigabitEthernet0/3
O        10.0.5.0/24 [110/4] via 10.0.1.2, 01:25:54, GigabitEthernet0/2
C        10.1.0.0/24 is directly connected, GigabitEthernet0/1
L        10.1.0.1/32 is directly connected, GigabitEthernet0/1
S        10.2.0.0/16 [1/0] via 10.0.4.4
O IA     10.2.0.0/24 [110/4] via 10.0.1.2, 00:10:27, GigabitEthernet0/2
  </p>
  <p>
   PC1#traceroute 10.2.0.102
Type escape sequence to abort.
Tracing the route to 10.2.0.102
VRF info: (vrf in name/id, vrf out name/id)
  1 10.1.0.1 4 msec 4 msec 3 msec
  2 10.0.1.2 5 msec 6 msec 7 msec
  3 10.0.2.3 9 msec 12 msec 8 msec
  4 10.0.3.5 8 msec 16 msec 7 msec
  5 10.2.0.102 8 msec 16 msec
   <em>
    PC1#traceroute 10.2.0.102
Type escape sequence to abort.
Tracing the route to 10.2.0.102
VRF info: (vrf in name/id, vrf out name/id)
  1 10.1.0.1 3 msec 3 msec 3 msec
  2 10.0.4.4 5 msec 3 msec 8 msec
  3 10.0.5.5 6 msec 8 msec 10 msec
  4 10.2.0.102 12 msec 8 msec
   </em>
   PC1#
  </p>
  <p>
   PC1#traceroute 10.2.0.102
Type escape sequence to abort.
Tracing the route to 10.2.0.102
VRF info: (vrf in name/id, vrf out name/id)
  1 10.1.0.1 8 msec 4 msec 2 msec
  2 10.0.4.4 7 msec 6 msec 5 msec
  3 10.0.5.5 7 msec 6 msec 11 msec
  4 10.2.0.102 8 msec 20 msec *
PC1#
PC1#
PC1#traceroute 10.2.0.102
Type escape sequence to abort.
Tracing the route to 10.2.0.102
VRF info: (vrf in name/id, vrf out name/id)
  1 10.1.0.1 3 msec 5 msec 3 msec
  2 10.0.1.2 2 msec 5 msec 3 msec
  3 10.0.2.3 12 msec 5 msec 6 msec
  4 10.0.3.5 7 msec 4 msec 4 msec
  5 10.2.0.102 5 msec 9 msec *
  </p>
  <h1>
   コラム
  </h1>
  <p>
   ルーターとスイッチのソフトウェアとハードウェア
RIBとFIB
転送用のASICとバックプレーン側のASIC
  </p>
  <p>
   PCとルーターは同じネットワークに接続されているため、パケットをルーターに送るには第二章で説明した手順が使われます。
復習がてらに説明すると以下の流れとなります。
  </p>
  <ol>
   <li>
    ARPでデフォルトゲートウェイのMACアドレスを問い合わせ(キャッシュされている場合は3へ)
   </li>
   <li>
    デフォルトゲートウェイであるルーターがMACアドレスを通知
   </li>
   <li>
    宛先MACアドレスをデフォルトゲートウェイのMACに設定し、パケットを転送
   </li>
   <li>
    パケットを受け取ったルーターは宛先に応じてそのパケットをさらに転送
   </li>
  </ol>
  <p>
   ルーターから他のルーターに転送する場合も同様にARPを使って、
次の宛先となるルータのMACアドレスを取得して同じネットワーク内の転送をします。
ルーターから「パケットを届ける宛先の最終地点であるホスト」に転送する場合もARPとL2転送が使われます。
  </p>
  <p>
   ルーターの転送の仕組みは追って話しますが、ネットワークA,B,Cという構成でネットワークAにいるホストから、
ネットワークCにいるホストに通信をする場合は以下のようなパケットになります。
  </p>
  <p>
   &lt;&lt;図&gt;&gt;
  </p>
  <p>
   重要なのはL2転送に使われるMACアドレスはネットワークごとに変わるのに対して、
L3転送に使われるIPアドレスは送信元から宛先まで常に同じことです。
MACアドレスはL2転送に使われて、IPアドレスがL3転送に使われるという仕組みがあるため当然といえば当然ですが、
きちんとネットワークのことを勉強した人以外はあまり認識していないような気がします。
  </p>
  <p>
   R1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR
  </p>
  <p>
   Gateway of last resort is not set
  </p>
  <div class="codehilite">
   <pre><span></span>  10.0.0.0/8 is variably subnetted, 4 subnets, 2 masks
</pre>
  </div>
  <p>
   C        10.0.1.0/24 is directly connected, GigabitEthernet0/1
L        10.0.1.1/32 is directly connected, GigabitEthernet0/1
C        10.0.2.0/24 is directly connected, GigabitEthernet0/2
L        10.0.2.1/32 is directly connected, GigabitEthernet0/2
  </p>
  <!-- GENERATED HTML END -->
 </body>
</html>
